Repository: kushaldas/securitybook
Catalog: po/*.po
Languages: sv

source: iOS 26.2 represents Apple's most comprehensive security and privacy update to date. Key priorities:
sv: iOS 26.2 representerar Apples mest omfattande säkerhets- och integritetsuppdatering hittills. Viktiga prioriteringar:

source: **Update to iOS 26.2 immediately** – Patches actively exploited zero-day vulnerabilities
sv: **Uppdatera till iOS 26.2 omedelbart** – Patchar aktivt utnyttjade nolldagssårbarheter

source: **Enable lockdown mode** – Prevents sophisticated spyware attacks
sv: **Aktivera Låsningsläge** – Förhindrar sofistikerade spionprogramattacker

source: **Enable Stolen Device Protection** – Prevents thieves from accessing data even with your passcode
sv: **Aktivera Skydd för stulen enhet** – Förhindrar tjuvar från att komma åt data även med din lösenkod

source: **Turn on Advanced Data Protection** – End-to-end encrypts your iCloud data
sv: **Aktivera Avancerat dataskydd** – Krypterar dina iCloud-data ändpunkt-till-ändpunkt

source: **Enable Advanced Tracking Protection for All Browsing** – Major anti-fingerprinting improvement
sv: **Aktivera avancerat spårningsskydd för all surfning** – Stor förbättring mot fingeravtrycksspårning

source: **Configure Wired Accessories security** – Protects against malicious charging cables
sv: **Konfigurera säkerhet för trådbundna tillbehör** – Skyddar mot skadliga laddkablar

source: **Use Passkeys** – Let iOS 26 automatically upgrade your passwords to phishing-resistant passkeys
sv: **Använd Passkeys** – Låt iOS 26 automatiskt uppgradera dina lösenord till nätfiskeresistenta Passkeys

source: **Restart after updates** – Clears memory-resident threats
sv: **Starta om efter uppdateringar** – Rensar minnesresidenta hot

source: By configuring these settings, you significantly strengthen your privacy and security against both common and sophisticated threats.
sv: Genom att konfigurera dessa inställningar stärker du avsevärt din integritet och säkerhet mot både vanliga och sofistikerade hot.

source: _Last updated: January 29, 2026 | Applies to iOS 26.2.1_ _Device requirements: iPhone 11 or later (A13 Bionic chip minimum)_ _AirTag (2nd Generation) requires iOS 26.2.1_
sv: _Senast uppdaterad: 29 januari 2026 | Gäller för iOS 26.2.1_ _Enhetskrav: iPhone 11 eller senare (minst A13 Bionic-chip)_ _AirTag (2:a generationen) kräver iOS 26.2.1_

source: Android 16 Security and Privacy Settings Guide
sv: Guide för säkerhets- och integritetsinställningar i Android 16

source: A comprehensive guide to configuring security and privacy settings on Android 16 to protect your personal data and secure your device.
sv: En omfattande guide för att konfigurera säkerhets- och integritetsinställningar i Android 16 för att skydda dina personuppgifter och säkra din enhet.

source: What's New in Android 16
sv: Nyheter i Android 16

source: Android 16, released in June 2025, represents Google's most significant security update, featuring a comprehensive "Advanced Protection Mode" that consolidates multiple security features into one easy toggle.
sv: Android 16, som släpptes i juni 2025, representerar Googles mest betydande säkerhetsuppdatering, med ett omfattande "Avancerat skydd" som samlar flera säkerhetsfunktioner i en enkel omkopplare.

source: Major Security & Privacy Additions
sv: Stora säkerhets- och integritetstillägg

source: **Advanced Protection Mode** – One-tap activation of all major security features
sv: **Avancerat skydd** – Aktivera alla viktiga säkerhetsfunktioner med ett tryck

source: **Identity Check** – Biometric authentication required for sensitive settings when away from trusted locations
sv: **Identitetskoll** – Biometrisk autentisering krävs för känsliga inställningar när du är borta från betrodda platser

source: **AI-Powered Privacy Controls** – Contextual permission management based on usage patterns
sv: **AI-drivna integritetskontroller** – Kontextbaserad behörighetshantering baserad på användningsmönster

source: **Enhanced Theft Protection** – Theft Detection Lock, Offline Device Lock, Inactivity Reboot
sv: **Förbättrat stöldskydd** – Stölddetekteringslås, offlineenhetslås, omstart vid inaktivitet

source: **Intrusion Logging** – Encrypted activity logs for post-breach analysis (coming in QPR3, March 2026)
sv: **Intrångsloggning** – Krypterade aktivitetsloggar för analys efter intrång (kommer i QPR3, mars 2026)

source: **USB Protection** – Default charging-only mode when locked
sv: **USB-skydd** – Standardläge endast laddning när låst

source: **Improved Scam Detection** – Real-time AI-powered scam call and message protection
sv: **Förbättrad bedrägeridetektering** – AI-drivet skydd mot bedrägerisamtal och meddelanden i realtid

source: **Enhanced Factory Reset Protection** – Stolen devices become harder to use
sv: **Förbättrat fabriksåterställningsskydd** – Stulna enheter blir svårare att använda

source: **Trade-in Mode** – Secure device preparation for resale
sv: **Inbytesläge** – Säker enhetsförberedelse för återförsäljning

source: **Fixed Approximate Location** – Prevents apps from inferring precise location through workarounds
sv: **Fixad ungefärlig plats** – Förhindrar appar från att härleda exakt plats genom kringgående metoder

source: **Local Network Protection** – New runtime permission for local network access
sv: **Lokalt nätverksskydd** – Ny körtidsbehörighet för lokal nätverksåtkomst

source: **Restore Credentials** – Seamless passkey migration to new devices
sv: **Återställ autentiseringsuppgifter** – Sömlös nyckelmigrering till nya enheter

source: Device Requirements
sv: Enhetskrav

source: Android 16 stable released June 2025
sv: Android 16 stabil version släppt juni 2025

source: Available on Google Pixel and expanding to other manufacturers
sv: Tillgänglig på Google Pixel och expanderar till andra tillverkare

source: Some features require specific hardware (e.g., motion sensors for Theft Detection Lock)
sv: Vissa funktioner kräver specifik hårdvara (t.ex. rörelsesensorer för stölddetekteringslås)

source: 1. Advanced Protection Mode
sv: 1. Avancerat skydd

source: Advanced Protection Mode is Android 16's flagship security feature—a single toggle that activates Google's strongest device protections.
sv: Avancerat skydd är Android 16:s flaggskeppsfunktion för säkerhet—en enda omkopplare som aktiverar Googles starkaste enhetsskydd.

source: What It Enables
sv: Vad det aktiverar

source: **Device Security:**
sv: **Enhetssäkerhet:**

source: Theft Detection Lock (AI-powered theft detection)
sv: Stölddetekteringslås (AI-driven stölddetektering)

source: Offline Device Lock (locks when disconnected)
sv: Offlineenhetslås (låser när frånkopplad)

source: Inactivity Reboot (restarts after 72 hours locked)
sv: Omstart vid inaktivitet (startar om efter 72 timmar låst)

source: USB Protection (charging-only when locked)
sv: USB-skydd (endast laddning när låst)

source: **App Security:**
sv: **Appsäkerhet:**

source: Google Play Protect (cannot be disabled)
sv: Google Play Protect (kan inte inaktiveras)

source: Blocks installation from unknown sources
sv: Blockerar installation från okända källor

source: Android Safe Browsing
sv: Android Säker surfning

source: **Network Security:**
sv: **Nätverkssäkerhet:**

source: Disables 2G connections
sv: Inaktiverar 2G-anslutningar

source: Blocks auto-reconnect to insecure networks
sv: Blockerar automatisk återanslutning till osäkra nätverk

source: Forces HTTPS in Chrome
sv: Tvingar HTTPS i Chrome

source: **Communication Protection:**
sv: **Kommunikationsskydd:**

source: Scam Detection in Phone app
sv: Bedrägeridetektering i Telefon-appen

source: Spam filtering in Google Messages
sv: Skräppostfiltrering i Google Messages

source: Unsafe link warnings
sv: Varningar för osäkra länkar

source: **Coming Soon:**
sv: **Kommer snart:**

source: Intrusion Logging (encrypted activity logs)
sv: Intrångsloggning (krypterade aktivitetsloggar)

source: Enhanced app permission controls
sv: Förbättrade appbehörighetskontroller

source: Tap **Security & Privacy**
sv: Tryck på **Säkerhet och integritet**

source: Tap **Advanced Protection**
sv: Tryck på **Avancerat skydd**

source: Toggle on **Device Protection**
sv: Aktivera **Enhetsskydd**

source: Tap **Turn on** and then **Restart**
sv: Tryck på **Aktivera** och sedan **Starta om**

source: Journalists, activists, public figures
sv: Journalister, aktivister, offentliga personer

source: Anyone wanting maximum protection
sv: Alla som vill ha maximalt skydd

source: Users who don't need to sideload apps
sv: Användare som inte behöver installera appar från okända källor

source: Considerations
sv: Överväganden

source: Cannot sideload apps from unknown sources
sv: Kan inte installera appar från okända källor

source: JavaScript optimizer disabled in Chrome (may break some websites)
sv: JavaScript-optimerare inaktiverad i Chrome (kan göra att vissa webbplatser inte fungerar)

source: Some call screening may flag legitimate calls
sv: Viss samtalsfiltrering kan flagga legitima samtal

source: Easy to turn on/off, so no harm in trying
sv: Enkelt att slå på/av, så det skadar inte att prova

source: Google Advanced Protection Program
sv: Googles program Avancerat skydd

source: The Advanced Protection Program is Google's strongest account-level security offering, separate from the device-level Advanced Protection Mode above. It is designed for people at high risk of targeted online attacks, such as journalists, activists, political campaign staff, and anyone managing sensitive information.
sv: Programmet Avancerat skydd är Googles starkaste kontosäkerhet, separat från enhetsnivåns Avancerat skydd ovan. Det är utformat för personer med hög risk för riktade attacker på internet, såsom journalister, aktivister, politisk kampanjpersonal och alla som hanterar känslig information.

source: **What it protects:**
sv: **Vad det skyddar:**

source: **Phishing defense** — Requires a passkey or FIDO-compliant security key to sign in. Unauthorized users cannot access your account even if they have your password.
sv: **Skydd mot nätfiske** — Kräver en nyckel eller en säkerhetsnyckel som är kompatibel med FIDO för att logga in. Obehöriga användare kan inte komma åt ditt konto även om de har ditt lösenord.

source: **Download safety** — Enhanced screening for file downloads; app installations restricted to verified sources like Google Play Store and device manufacturer app stores.
sv: **Skydd mot skadliga nedladdningar** — Ingående kontroller före varje nedladdning. Endast appinstallationer från verifierade butiker, t.ex. Google Play Butik och enhetstillverkarens appbutik, tillåts.

source: **Third-party access control** — Only Google apps and verified third-party apps can access your Google Account data, and only with your permission.
sv: **Kontroll av tredjepartsåtkomst** — Endast Googles appar och verifierade appar från tredje part får åtkomst till data i Google-kontot, och endast med din tillåtelse.

source: **How to enroll:**
sv: **Så här registrerar du dig:**

source: Go to [Google Advanced Protection Program](https://landing.google.com/advancedprotection/)
sv: Gå till [Googles program Avancerat skydd](https://landing.google.com/advancedprotection/)

source: Sign in with the Google Account you want to protect
sv: Logga in med det Google-konto du vill skydda

source: Set up a passkey or register a FIDO-compliant security key (e.g., Google Titan Security Key)
sv: Konfigurera en nyckel eller registrera en säkerhetsnyckel som är kompatibel med FIDO (t.ex. Googles Titan-säkerhetsnyckel)

source: Follow the enrollment steps
sv: Följ registreringsstegen

source: A passkey or FIDO-compliant security key
sv: En nyckel eller en säkerhetsnyckel som är kompatibel med FIDO

source: A Google Account with 2-Step Verification enabled
sv: Ett Google-konto med tvåstegsverifiering aktiverat

source: The Advanced Protection Program enforces strict restrictions. Third-party apps that require access to Gmail or Drive data may stop working. Account recovery is intentionally harder — if you lose your passkey or security key, regaining access will require additional verification steps.
sv: Programmet Avancerat skydd tillämpar strikta begränsningar. Appar från tredje part som kräver åtkomst till Gmail- eller Drive-data kan sluta fungera. Kontoåterställning är avsiktligt svårare — om du tappar bort din nyckel eller säkerhetsnyckel krävs ytterligare verifieringssteg för att återfå åtkomst.

source: 2. Device Authentication
sv: 2. Enhetsautentisering

source: Screen Lock Options
sv: Skärmlåsalternativ

source: Android 16 supports multiple screen lock methods:
sv: Android 16 stöder flera skärmlåsmetoder:

source: Go to **Settings > Security & Privacy > Device Unlock > Screen Lock**
sv: Gå till **Inställningar > Säkerhet och integritet > Enhetslås > Skärmlås**

source: Choose your lock type:
sv: Välj din låstyp:

source: **PIN** – 6+ digits recommended
sv: **PIN** – 6+ siffror rekommenderas

source: **Password** – Most secure (alphanumeric)
sv: **Lösenord** – Säkrast (alfanumeriskt)

source: **Pattern** – Less secure, avoid simple patterns
sv: **Mönster** – Mindre säkert, undvik enkla mönster

source: **Fingerprint** – Convenient biometric
sv: **Fingeravtryck** – Bekväm biometri

source: **Face Unlock** – Available on supported devices
sv: **Ansiktslås** – Tillgängligt på enheter som stöds

source: **Best Practice:** Use a PIN with 6+ digits or an alphanumeric password. Add fingerprint for convenience.
sv: **Bästa praxis:** Använd en PIN med 6+ siffror eller ett alfanumeriskt lösenord. Lägg till fingeravtryck för bekvämlighet.

source: Two-Factor Authentication (2FA) for Google Account
sv: Tvåfaktorsautentisering (2FA) för Google-konto

source: **How to enable:**
sv: **Så här aktiverar du:**

source: Go to **Settings > Google > Manage your Google Account**
sv: Gå till **Inställningar > Google > Hantera ditt Google-konto**

source: Tap **Security**
sv: Tryck på **Säkerhet**

source: Under "How you sign in to Google," tap **2-Step Verification**
sv: Under "Så loggar du in på Google" trycker du på **Tvåstegsverifiering**

source: Follow setup instructions
sv: Följ installationsinstruktionerna

source: Add multiple verification methods (authenticator app, backup codes, security key)
sv: Lägg till flera verifieringsmetoder (autentiseringsapp, reservkoder, säkerhetsnyckel)

source: Biometric Settings
sv: Biometriska inställningar

source: Go to **Settings > Security & Privacy > Device Unlock > Fingerprint** (or Face Unlock)
sv: Gå till **Inställningar > Säkerhet och integritet > Enhetslås > Fingeravtryck** (eller Ansiktslås)

source: Add your biometrics
sv: Lägg till din biometri

source: Configure what biometrics can unlock (device, apps, payments)
sv: Konfigurera vad biometri kan låsa upp (enhet, appar, betalningar)

source: Security Keys for Google Account
sv: Säkerhetsnycklar för Google-konto

source: Security keys are physical devices that serve as a second authentication factor for your Google Account. They replace SMS or authenticator app codes with a physical device you must have present, making phishing attacks ineffective.
sv: Säkerhetsnycklar är fysiska enheter som fungerar som en andra autentiseringsfaktor för ditt Google-konto. De ersätter SMS eller koder från autentiseringsappar med en fysisk enhet som du måste ha till hands, vilket gör nätfiskeattacker verkningslösa.

source: A FIDO2-compliant security key (e.g., Google Titan Security Key, YubiKey 5 series)
sv: En säkerhetsnyckel som är kompatibel med FIDO2 (t.ex. Googles Titan-säkerhetsnyckel, YubiKey 5-serien)

source: Google Account with 2-Step Verification enabled
sv: Google-konto med tvåstegsverifiering aktiverat

source: **NFC** — Tap the key against the back of your Android phone
sv: **NFC** — Håll nyckeln mot baksidan av din Android-telefon

source: **USB-C** — Plug directly into your phone or computer
sv: **USB-C** — Anslut direkt till din telefon eller dator

source: **USB-A** — For computers with USB-A ports
sv: **USB-A** — För datorer med USB-A-portar

source: **Bluetooth** — Google Titan Security Key supports BLE pairing
sv: **Bluetooth** — Googles Titan-säkerhetsnyckel stöder BLE-parkoppling

source: **How to add a security key:**
sv: **Så här lägger du till en säkerhetsnyckel:**

source: Tap **Security key**
sv: Tryck på **Säkerhetsnyckel**

source: Follow the on-screen instructions to register your key
sv: Följ instruktionerna på skärmen för att registrera din nyckel

source: Signing in to your Google Account on a new device or browser
sv: Logga in på ditt Google-konto på en ny enhet eller webbläsare

source: Accessing sensitive account settings
sv: Komma åt känsliga kontoinställningar

source: Signing in to apps and services that use Google authentication
sv: Logga in på appar och tjänster som använder Google-autentisering

source: **Using your security key on Android:**
sv: **Så här använder du säkerhetsnyckeln på Android:**

source: **NFC keys:** When prompted, tap the key against the back of your phone
sv: **NFC-nycklar:** Håll nyckeln mot baksidan av telefonen när du uppmanas

source: **USB keys:** Plug the key into your phone's USB-C port when prompted
sv: **USB-nycklar:** Anslut nyckeln till telefonens USB-C-port när du uppmanas

source: **Bluetooth keys:** Pair once, then press the button on the key when prompted
sv: **Bluetooth-nycklar:** Parkoppla en gång, tryck sedan på knappen på nyckeln när du uppmanas

source: Register at least two security keys and store the backup in a safe place. If you lose all your security keys and have no other recovery method, you could be locked out of your Google Account.
sv: Registrera minst två säkerhetsnycklar och förvara reservnyckeln på ett säkert ställe. Om du tappar bort alla dina säkerhetsnycklar och inte har någon annan återställningsmetod kan du bli utestängd från ditt Google-konto.

source: 3. Identity Check
sv: 3. Identitetskoll

source: Identity Check requires biometric authentication for sensitive actions when you're away from trusted locations—similar to iOS's Stolen Device Protection.
sv: Identitetskoll kräver biometrisk autentisering för känsliga åtgärder när du är borta från betrodda platser—liknande iOS Skydd för stulen enhet.

source: What It Protects
sv: Vad det skyddar

source: When outside trusted locations, biometric authentication is required for:
sv: När du är utanför betrodda platser krävs biometrisk autentisering för:

source: Changing device PIN or password
sv: Ändra enhetens PIN eller lösenord

source: Changing biometric settings
sv: Ändra biometriska inställningar

source: Disabling theft protection
sv: Inaktivera stöldskydd

source: Accessing passkeys
sv: Komma åt nycklar

source: Factory resetting the device
sv: Fabriksåterställa enheten

source: Changing Google Account settings
sv: Ändra Google-kontoinställningar

source: Go to **Settings > Security & Privacy > Device Unlock > Theft Protection**
sv: Gå till **Inställningar > Säkerhet och integritet > Enhetslås > Stöldskydd**

source: Tap **Identity Check**
sv: Tryck på **Identitetskoll**

source: Add trusted locations (home, work)
sv: Lägg till betrodda platser (hem, arbete)

source: Android 16 on supported devices (Pixel, Samsung One UI 7, others)
sv: Android 16 på enheter som stöds (Pixel, Samsung One UI 7, andra)

source: Screen lock and biometrics enabled
sv: Skärmlås och biometri aktiverat

source: Location services enabled
sv: Platstjänster aktiverat

source: Best Practice
sv: Bästa praxis

source: Only add truly trusted private locations
sv: Lägg endast till verkligt betrodda privata platser

source: Never add public places as trusted locations
sv: Lägg aldrig till offentliga platser som betrodda platser

source: 4. Theft Protection
sv: 4. Stöldskydd

source: Android 16 consolidates multiple theft protection features.
sv: Android 16 samlar flera stöldskyddsfunktioner.

source: Theft Detection Lock
sv: Stölddetekteringslås

source: Uses AI and device sensors to detect if someone snatches your phone and runs.
sv: Använder AI och enhetens sensorer för att upptäcka om någon rycker åt sig din telefon och springer.

source: Go to **Settings > Google > All services > Theft Protection**
sv: Gå till **Inställningar > Google > Alla tjänster > Stöldskydd**

source: Toggle on **Theft Detection Lock**
sv: Aktivera **Stölddetekteringslås**

source: Monitors motion sensors, Wi-Fi, and Bluetooth
sv: Övervakar rörelsesensorer, Wi-Fi och Bluetooth

source: Automatically locks screen if theft is detected
sv: Låser automatiskt skärmen om stöld upptäcks

source: Won't trigger during stable connections
sv: Utlöses inte under stabila anslutningar

source: Offline Device Lock
sv: Offlineenhetslås

source: Automatically locks your device if it goes offline (thief turns off internet).
sv: Låser automatiskt din enhet om den går offline (tjuven stänger av internet).

source: Toggle on **Offline Device Lock**
sv: Aktivera **Offlineenhetslås**

source: Failed Authentication Lock
sv: Lås vid misslyckad autentisering

source: Locks device after repeated failed unlock attempts.
sv: Låser enheten efter upprepade misslyckade upplåsningsförsök.

source: Toggle on **Failed Authentication Lock** (may be on by default)
sv: Aktivera **Lås vid misslyckad autentisering** (kan vara på som standard)

source: Inactivity Reboot
sv: Omstart vid inaktivitet

source: Automatically restarts device after 72 hours of being locked, making data unreadable until fresh unlock.
sv: Startar automatiskt om enheten efter 72 timmar av att vara låst, vilket gör data oläsbar tills ny upplåsning.

source: **Enabled automatically with Advanced Protection**
sv: **Aktiveras automatiskt med Avancerat skydd**

source: Remote Lock
sv: Fjärrlås

source: Lock your device remotely via Find My Device with security challenge question.
sv: Lås din enhet på distans via Hitta min enhet med säkerhetsfråga.

source: Factory Reset Protection
sv: Fabriksåterställningsskydd

source: Enhanced in Android 16 to restrict all functions on devices reset without authorization.
sv: Förbättrat i Android 16 för att begränsa alla funktioner på enheter som återställts utan auktorisering.

source: 5. App Permissions
sv: 5. Appbehörigheter

source: Permission Manager
sv: Behörighetshanterare

source: Review and control what data apps can access:
sv: Granska och kontrollera vilka data appar kan komma åt:

source: Go to **Settings > Security & Privacy > Privacy Controls > Permission Manager**
sv: Gå till **Inställningar > Säkerhet och integritet > Integritetskontroller > Behörighetshanterare**

source: Review each category:
sv: Granska varje kategori:

source: Camera
sv: Kamera

source: Microphone
sv: Mikrofon

source: Contacts
sv: Kontakter

source: Files and media
sv: Filer och media

source: Calendar
sv: Kalender

source: Phone
sv: Telefon

source: Body sensors / Health
sv: Kroppssensorer / Hälsa

source: Nearby devices
sv: Enheter i närheten

source: Permission Options
sv: Behörighetsalternativ

source: For each app, you can choose:
sv: För varje app kan du välja:

source: **Allow all the time** – Background access (use sparingly)
sv: **Tillåt alltid** – Bakgrundsåtkomst (använd sparsamt)

source: **Allow only while using the app** – Access only when app is open
sv: **Tillåt endast när appen används** – Åtkomst endast när appen är öppen

source: **Ask every time** – Prompts each use
sv: **Fråga varje gång** – Frågar vid varje användning

source: **Don't allow** – No access
sv: **Tillåt inte** – Ingen åtkomst

source: One-Time Permissions
sv: Engångsbehörigheter

source: For camera, microphone, and location, you can grant one-time access that revokes when you close the app.
sv: För kamera, mikrofon och plats kan du ge engångsåtkomst som återkallas när du stänger appen.

source: Auto-Reset Unused App Permissions
sv: Automatisk återställning av oanvända appbehörigheter
