Repository: kushaldas/securitybook
Catalog: po/*.po
Languages: sv

source: Summary
sv: Sammanfattning

source: Chapter 1
sv: Kapitel 1

source: iOS Security and Privacy Settings
sv: Säkerhets- och integritetsinställningar för iOS

source: Android Security and Privacy Settings
sv: Säkerhets- och integritetsinställningar för Android

source: GrapheneOS Security and Privacy Settings
sv: Säkerhets- och integritetsinställningar för GrapheneOS

source: Security Guide book
sv: Säkerhetsguidebok

source: In this book we will try to keep up with the latest security features and best practices.
sv: I den här boken försöker vi hålla oss uppdaterade med de senaste säkerhetsfunktionerna och bästa praxis.

source: We have 3 chapters so far, for iOS, Android and GrapheneOS. You can access them from the left sidebar.
sv: Vi har 3 kapitel hittills, för iOS, Android och GrapheneOS. Du kan komma åt dem från vänster sidofält.

source: iOS 26.2.1 Security and Privacy Settings Guide
sv: Guide för säkerhets- och integritetsinställningar i iOS 26.2.1

source: A comprehensive guide to configuring security and privacy settings on iOS 26.2.1 (the latest version as of January 29, 2026) to protect your personal data and secure your iPhone.
sv: En omfattande guide för att konfigurera säkerhets- och integritetsinställningar i iOS 26.2.1 (den senaste versionen per 29 januari 2026) för att skydda dina personuppgifter och säkra din iPhone.

source: What's New in iOS 26
sv: Nyheter i iOS 26

source: iOS 26 (released September 15, 2025) represents Apple's biggest security and privacy update in years. Apple jumped from iOS 18 to iOS 26 to align version numbers with the year across all operating systems.
sv: iOS 26 (släppt 15 september 2025) representerar Apples största säkerhets- och integritetsuppdatering på flera år. Apple hoppade från iOS 18 till iOS 26 för att harmonisera versionsnummer med årtalet över alla operativsystem.

source: Major Security & Privacy Additions in iOS 26
sv: Stora säkerhets- och integritetstillägg i iOS 26

source: **Wi-Fi Aware** – Secure peer-to-peer connections without internet access points
sv: **Wi-Fi Aware** – Säkra peer-to-peer-anslutningar utan internetåtkomstpunkter

source: **Post-Quantum Cryptography** – Hybrid key exchange protecting against future quantum computing threats
sv: **Postkvantkryptografi** – Hybridnyckelutbyte som skyddar mot framtida kvantdatorhot

source: **Expanded Passkey Support** – Automatic passkey creation and migration from passwords
sv: **Utökat stöd för nycklar** – Automatiskt skapande av nycklar och migrering från lösenord

source: **Advanced Tracking Protection for All Browsing** – Anti-fingerprinting expanded beyond Private Browsing
sv: **Avancerat spårningsskydd för all surfning** – Skydd mot fingeravtrycksspårning utökat bortom privat surfning

source: **Wired Accessories Security** – Explicit permission controls for USB-C/Lightning accessories
sv: **Säkerhet för trådbundna tillbehör** – Uttryckliga behörighetskontroller för USB-C/Lightning-tillbehör

source: **Enhanced Parental Controls** – Stronger child account management and content filtering
sv: **Förbättrade föräldrakontroller** – Starkare hantering av barnkonton och innehållsfiltrering

source: **Password Version History** – Track changes to saved passwords over time
sv: **Lösenordsversionshistorik** – Spåra ändringar av sparade lösenord över tid

source: **Secure Password Export** – FIDO Alliance standard for moving credentials between managers
sv: **Säker lösenordsexport** – FIDO Alliance-standard för att flytta inloggningsuppgifter mellan lösenordshanterare

source: **Liquid Glass Design** – New translucent interface (including privacy-focused opacity controls)
sv: **Liquid Glass-design** – Nytt genomskinligt gränssnitt (inklusive integritetsfokuserade opacitetskontroller)

source: iOS 26.2 Security Updates (December 2025)
sv: iOS 26.2-säkerhetsuppdateringar (december 2025)

source: **26+ security vulnerabilities patched**, including two actively exploited WebKit zero-days
sv: **26+ säkerhetssårbarheter korrigerade**, inklusive två aktivt utnyttjade WebKit-nolldagssårbarheter

source: **AirDrop security codes** – One-time codes for sharing with unknown contacts
sv: **AirDrop-säkerhetskoder** – Engångskoder för delning med okända kontakter

source: **Hidden Photos fix** – Addressed vulnerability allowing unauthorized access
sv: **Korrigering för dolda foton** – Åtgärdade sårbarhet som tillät obehörig åtkomst

source: **FaceTime caller ID spoofing** – Patched to prevent impersonation attacks
sv: **FaceTime-förfalskning av uppringarens ID** – Korrigerat för att förhindra identitetsattacker

source: **iMessage privacy controls** – Improved data handling
sv: **iMessage-integritetskontroller** – Förbättrad datahantering

source: iOS 26.2.1 (January 26, 2026)
sv: iOS 26.2.1 (26 januari 2026)

source: iOS 26.2.1 is a minor update focused on new hardware support and bug fixes.
sv: iOS 26.2.1 är en mindre uppdatering med fokus på nytt maskinvarustöd och buggfixar.

source: **New Features:**
sv: **Nya funktioner:**

source: **AirTag (2nd Generation) support** – Required for the new AirTag with:
sv: **Stöd för AirTag (2:a generationen)** – Krävs för nya AirTag med:

source: Second-generation Ultra Wideband (UWB) chip for 50% longer Precision Finding range
sv: Andra generationens Ultra Wideband (UWB)-chip för 50 % längre räckvidd med Precision Finding

source: Precision Finding on Apple Watch (Series 9+, Ultra 2+) for the first time
sv: Precision Finding på Apple Watch (Series 9+, Ultra 2+) för första gången

source: 50% louder speaker for easier locating and enhanced anti-stalking measures
sv: 50 % högre högtalare för enklare lokalisering och förbättrade antistalkningsåtgärder

source: Expanded Bluetooth range for better Find My network detection
sv: Utökad Bluetooth-räckvidd för bättre Hitta-nätverksdetektering

source: Share Item Location with 36+ airlines for lost luggage recovery
sv: Dela objektets plats med 36+ flygbolag för återfinnande av förlorat bagage

source: **Bug Fixes:**
sv: **Buggfixar:**

source: Emergency calling fix for older mobile phones
sv: Korrigering av nödsamtal för äldre mobiltelefoner

source: Unspecified stability improvements
sv: Ospecificerade stabilitetsförbättringar

source: **Security Notes:**
sv: **Säkerhetsanteckningar:**

source: No published CVE entries for iOS 26.2.1 itself
sv: Inga publicerade CVE-poster för iOS 26.2.1 i sig

source: Users on iOS 26-compatible devices should update to maintain security (older iOS versions only receive certificate updates)
sv: Användare på iOS 26-kompatibla enheter bör uppdatera för att bibehålla säkerheten (äldre iOS-versioner får endast certifikatuppdateringar)

source: **Also Released:**
sv: **Även släppt:**

source: iOS 18.7.4, iOS 16.7.13, iOS 15.8.6, iOS 12.5.8 – Certificate updates for iMessage, FaceTime, and Apple account sign-in (valid until January 2027)
sv: iOS 18.7.4, iOS 16.7.13, iOS 15.8.6, iOS 12.5.8 – Certifikatuppdateringar för iMessage, FaceTime och inloggning med Apple-konto (giltiga till januari 2027)

source: iOS 26.2.1 is required for AirTag (2nd Generation). Update via **Settings > General > Software Update**.
sv: iOS 26.2.1 krävs för AirTag (2:a generationen). Uppdatera via **Inställningar > Allmänt > Programuppdatering**.

source: 1. Device Authentication
sv: 1. Enhetsautentisering

source: Face ID / Touch ID Setup
sv: Konfigurera Face ID / Touch ID

source: Biometric authentication provides secure and convenient device access.
sv: Biometrisk autentisering ger säker och bekväm åtkomst till enheten.

source: **How to set up Face ID:**
sv: **Så konfigurerar du Face ID:**

source: Open **Settings**
sv: Öppna **Inställningar**

source: Tap **Face ID & Passcode**
sv: Tryck på **Face ID och lösenkod**

source: Enter your passcode
sv: Ange din lösenkod

source: Tap **Set Up Face ID**
sv: Tryck på **Ställ in Face ID**

source: Follow on-screen instructions to position your face
sv: Följ instruktionerna på skärmen för att positionera ditt ansikte

source: Move your head in a circle to complete the scan
sv: Rör huvudet i en cirkel för att slutföra skanningen

source: **Configure Face ID uses:**
sv: **Konfigurera användningsområden för Face ID:**

source: iPhone Unlock
sv: Lås upp iPhone

source: iTunes & App Store purchases
sv: iTunes- och App Store-köp

source: Password AutoFill
sv: Autofyll lösenord

source: Other Apps (toggle individually)
sv: Andra appar (aktivera individuellt)

source: Strong Passcode Configuration
sv: Konfiguration av stark lösenkod

source: **How to set a strong passcode:**
sv: **Så ställer du in en stark lösenkod:**

source: Go to **Settings > Face ID & Passcode**
sv: Gå till **Inställningar > Face ID och lösenkod**

source: Tap **Change Passcode**
sv: Tryck på **Ändra lösenkod**

source: Tap **Passcode Options**
sv: Tryck på **Lösenkodsinställningar**

source: Select **Custom Alphanumeric Code** (8-12 random characters recommended)
sv: Välj **Egen alfanumerisk kod** (8–12 slumpmässiga tecken rekommenderas)

source: Two-Factor Authentication (2FA)
sv: Tvåfaktorsautentisering (2FA)

source: **How to enable 2FA:**
sv: **Så aktiverar du 2FA:**

source: Go to **Settings > \[Your Name\] > Sign-In & Security**
sv: Gå till **Inställningar > \[Ditt namn\] > Inloggning och säkerhet**

source: Tap **Turn On Two-Factor Authentication**
sv: Tryck på **Aktivera tvåfaktorsautentisering**

source: Tap **Continue**
sv: Tryck på **Fortsätt**

source: Enter a trusted phone number
sv: Ange ett betrott telefonnummer

source: Verify with the code sent to your phone
sv: Verifiera med koden som skickas till din telefon

source: Auto-Lock Settings
sv: Inställningar för autolås

source: Go to **Settings > Display & Brightness > Auto-Lock**
sv: Gå till **Inställningar > Skärm och ljusstyrka > Autolås**

source: Select a time interval (30 seconds to 5 minutes recommended)
sv: Välj ett tidsintervall (30 sekunder till 5 minuter rekommenderas)

source: Security Keys for Apple Account
sv: Säkerhetsnycklar för Apple-konto

source: Security keys are small external devices that look like a thumb drive or tag. They provide extra protection for your Apple Account by replacing the standard six-digit verification code with a physical device as the second factor in two-factor authentication. Because they are physical, they help prevent attackers from intercepting or requesting your second factor through phishing.
sv: Säkerhetsnycklar är små externa enheter som ser ut som ett minne eller en tagg. De ger extra skydd för ditt Apple-konto genom att ersätta den sexsiffriga verifieringskoden med en fysisk enhet som den andra autentiseringsfaktorn i tvåfaktorsautentisering. Eftersom de är fysiska hjälper de till att förhindra att angripare avlyssnar eller begär din andra faktor via nätfiske.

source: **Requirements:**
sv: **Vad som krävs:**

source: At least two FIDO® Certified security keys (e.g., YubiKey 5C NFC, YubiKey 5Ci, or FEITIAN ePass K9 NFC)
sv: Minst två FIDO® Certified-säkerhetsnycklar (t.ex. YubiKey 5C NFC, YubiKey 5Ci eller FEITIAN ePass K9 NFC)

source: iOS 16.3 or later
sv: iOS 16.3 eller senare

source: Two-factor authentication already enabled on your Apple Account
sv: Tvåfaktorsautentisering har ställts in för ditt Apple-konto

source: A modern web browser
sv: En modern webbläsare

source: **Compatible connector types:**
sv: **Kompatibla kontakttyper:**

source: **NFC** — Works with iPhone via tap (contactless)
sv: **NFC** – Fungerar med iPhone via ett tryck (kontaktlöst)

source: **USB-C** — Works with iPhone 15 or later and most Mac models
sv: **USB-C** – Fungerar med iPhone 15 eller senare och de flesta Mac-modeller

source: **Lightning** — Works with iPhone 14 and earlier
sv: **Lightning** – Fungerar med iPhone 14 och tidigare

source: **USB-A** — Works with older Mac models
sv: **USB-A** – Fungerar med äldre Mac-modeller

source: **How to add security keys:**
sv: **Så här lägger du till säkerhetsnycklar:**

source: Tap **Two-Factor Authentication**
sv: Tryck på **Tvåfaktorsautentisering**

source: Tap **Security Keys**
sv: Tryck på **Säkerhetsnycklar**

source: Tap **Add Security Keys**
sv: Tryck på **Lägg till säkerhetsnycklar**

source: Follow the on-screen instructions
sv: Följ anvisningarna på skärmen

source: You can add up to six keys total
sv: Du kan lägga till upp till sex nycklar totalt

source: **What security keys protect:**
sv: **Det här skyddar säkerhetsnycklar:**

source: Signing in to your Apple Account on a new device or on the web
sv: Logga in på ditt Apple-konto på en ny enhet eller på webben

source: Resetting your Apple Account password or unlocking your account
sv: Återställa lösenordet för ditt Apple-konto eller låsa upp ditt konto

source: Adding or removing security keys
sv: Lägga till ytterligare säkerhetsnycklar eller ta bort en säkerhetsnyckel

source: You must keep at least two security keys in safe places. If you lose all your trusted devices and security keys, you could be locked out of your account permanently.
sv: Du måste ha minst två säkerhetsnycklar på säkra platser. Om du tappar bort alla dina betrodda enheter och säkerhetsnycklar kan du bli utestängd från ditt konto permanent.

source: Security keys are not compatible with child accounts or Managed Apple Accounts.
sv: Säkerhetsnycklar är inte kompatibla med barnkonton eller hanterade Apple-konton.

source: Apple Watch paired using a family member's iPhone is not supported.
sv: Apple Watch som är parkopplad med en familjemedlems iPhone stöds inte.

source: Devices signed in with your account that have not been used for more than 90 days will be signed out when you add security keys. You can sign back in to those devices using a security key.
sv: Enheter som är inloggade med ditt konto och som inte har använts på mer än 90 dagar loggas ut när du lägger till säkerhetsnycklar. Du kan logga in igen på dessa enheter med en säkerhetsnyckel.

source: 2. Stolen Device Protection
sv: 2. Skydd för stulen enhet

source: Stolen Device Protection adds security when your iPhone is away from familiar locations.
sv: Skydd för stulen enhet lägger till säkerhet när din iPhone är borta från kända platser.

source: Key Features
sv: Nyckelfunktioner

source: **Biometric Authentication Required** (no passcode fallback):
sv: **Biometrisk autentisering krävs** (ingen lösenkod som reserv):

source: Accessing passwords stored in iCloud Keychain
sv: Åtkomst till lösenord lagrade i iCloud-nyckelring

source: Using saved payment methods in Safari
sv: Användning av sparade betalningsmetoder i Safari

source: Turning off Lost Mode
sv: Stänga av Försvunnen-läge

source: Erasing all content and settings
sv: Radera allt innehåll och alla inställningar

source: Viewing Apple Card virtual card number
sv: Visa Apple Cards virtuella kortnummer

source: Opening locked and hidden apps
sv: Öppna låsta och dolda appar

source: **Security Delay** (1-hour wait + second biometric scan):
sv: **Säkerhetsfördröjning** (1 timmes väntetid + andra biometriska skanningen):

source: Changing Apple Account password
sv: Ändra lösenordet för Apple-konto

source: Signing out of Apple Account
sv: Logga ut från Apple-konto

source: Turning off Stolen Device Protection
sv: Stänga av Skydd för stulen enhet

source: Changing Face ID or Touch ID settings
sv: Ändra Face ID- eller Touch ID-inställningar

source: Changing device passcode
sv: Ändra enhetens lösenkod

source: Resetting all settings
sv: Återställa alla inställningar

source: Turning off Find My
sv: Stänga av Hitta

source: How to Enable
sv: Så aktiverar du

source: Scroll down and tap **Stolen Device Protection**
sv: Scrolla ner och tryck på **Skydd för stulen enhet**

source: Toggle on
sv: Aktivera

source: Configuration Options
sv: Konfigurationsalternativ

source: **Away from Familiar Locations** – Security features activate only when away from home/work
sv: **Borta från kända platser** – Säkerhetsfunktioner aktiveras endast när du är borta från hem/arbete

source: **Always** – Security features are always active
sv: **Alltid** – Säkerhetsfunktioner är alltid aktiva

source: Requirements
sv: Krav

source: iOS 17.3 or later (enhanced in iOS 26)
sv: iOS 17.3 eller senare (förbättrat i iOS 26)

source: Two-factor authentication enabled
sv: Tvåfaktorsautentisering aktiverad

source: Face ID or Touch ID configured
sv: Face ID eller Touch ID konfigurerat

source: Device passcode set
sv: Enhetens lösenkod inställd

source: Find My enabled
sv: Hitta aktiverat

source: Significant Locations enabled
sv: Viktiga platser aktiverat

source: 3. App Privacy Controls
sv: 3. Appintegritetskontroller

source: App Tracking Transparency
sv: Transparens för appspårning

source: **How to configure:**
sv: **Så konfigurerar du:**

source: Go to **Settings > Privacy & Security > Tracking**
sv: Gå till **Inställningar > Integritet och säkerhet > Spårning**

source: Toggle **Allow Apps to Request to Track** off to block all tracking
sv: Inaktivera **Tillåt att appar begär att spåra** för att blockera all spårning

source: Or manage individual app permissions below
sv: Eller hantera individuella appbehörigheter nedan

source: App Privacy Report
sv: Appintegritetsrapport

source: View detailed app data access:
sv: Visa detaljerad appdataåtkomst:

source: Go to **Settings > Privacy & Security > App Privacy Report**
sv: Gå till **Inställningar > Integritet och säkerhet > Appintegritetsrapport**

source: Toggle on **App Privacy Report**
sv: Aktivera **Appintegritetsrapport**

source: Review 7-day history of sensor, camera, microphone, and network access
sv: Granska 7-dagarshistorik för sensor-, kamera-, mikrofon- och nätverksåtkomst

source: Clipboard Access Alerts
sv: Varningar för urklippsåtkomst

source: iOS 26 continues to notify you whenever apps access your clipboard, preventing silent data harvesting.
sv: iOS 26 fortsätter att meddela dig när appar kommer åt ditt urklipp, vilket förhindrar tyst datainsamling.

source: Review All Permissions
sv: Granska alla behörigheter

source: Go to **Settings > Privacy & Security**
sv: Gå till **Inställningar > Integritet och säkerhet**

source: Review each category: Location, Contacts, Photos, Microphone, Camera, etc.
sv: Granska varje kategori: Plats, Kontakter, Bilder, Mikrofon, Kamera, etc.

source: Revoke unnecessary permissions
sv: Återkalla onödiga behörigheter

source: 4. Location Services
sv: 4. Platstjänster

source: Per-App Location Settings
sv: Platsinställningar per app

source: For each app, choose:
sv: Välj för varje app:

source: **Never** – No location access
sv: **Aldrig** – Ingen platsåtkomst

source: **Ask Next Time Or When I Share** – Prompts each time
sv: **Fråga nästa gång eller när jag delar** – Frågar varje gång

source: **While Using the App** – Access only when app is open
sv: **Medan appen används** – Åtkomst endast när appen är öppen

source: **Always** – Background access (use sparingly)
sv: **Alltid** – Bakgrundsåtkomst (använd sparsamt)

source: Precise vs. Approximate Location
sv: Exakt kontra ungefärlig plats

source: Go to **Settings > Privacy & Security > Location Services**
sv: Gå till **Inställningar > Integritet och säkerhet > Platstjänster**

source: Select an app
sv: Välj en app

source: Toggle **Precise Location** off for approximate area sharing
sv: Inaktivera **Exakt plats** för delning av ungefärligt område

source: Significant Locations
sv: Viktiga platser

source: Go to **Settings > Privacy & Security > Location Services > System Services**
sv: Gå till **Inställningar > Integritet och säkerhet > Platstjänster > Systemtjänster**

source: Tap **Significant Locations**
sv: Tryck på **Viktiga platser**

source: View, toggle off, or clear history
sv: Visa, inaktivera eller rensa historik

source: 5. Lock and Hide Apps
sv: 5. Lås och dölj appar

source: How to Lock an App
sv: Så låser du en app

source: Touch and hold the app icon on Home Screen
sv: Tryck och håll på appikonen på hemskärmen

source: Tap **Require Face ID** (or Touch ID/Passcode)
sv: Tryck på **Kräv Face ID** (eller Touch ID/lösenkod)

source: Confirm your choice
sv: Bekräfta ditt val

source: How to Lock and Hide an App
sv: Så låser och döljer du en app

source: Touch and hold the app icon
sv: Tryck och håll på appikonen

source: Select **Hide and Require Face ID**
sv: Välj **Dölj och kräv Face ID**

source: App moves to Hidden folder in App Library
sv: Appen flyttas till mappen Dolda i appbiblioteket

source: **To access hidden apps:**
sv: **För att komma åt dolda appar:**

source: Swipe left to App Library
sv: Svep åt vänster till appbiblioteket

source: Scroll to bottom, tap **Hidden** folder
sv: Scrolla till botten, tryck på mappen **Dolda**

source: Authenticate with Face ID/Touch ID
sv: Autentisera med Face ID/Touch ID

source: What Happens When Apps Are Locked
sv: Vad händer när appar är låsta

source: No notification previews
sv: Inga förhandsvisningar av notiser

source: Hidden from Spotlight search
sv: Dold från Spotlight-sökning

source: Hidden from Siri suggestions
sv: Dold från Siri-förslag

source: Call history from locked apps is hidden
sv: Samtalshistorik från låsta appar är dold

source: Integration with Stolen Device Protection
sv: Integration med Skydd för stulen enhet

source: When Stolen Device Protection is enabled, locked apps can **only** be opened with Face ID/Touch ID—passcode fallback is disabled.
sv: När Skydd för stulen enhet är aktiverat kan låsta appar **endast** öppnas med Face ID/Touch ID—lösenkod som reserv är inaktiverad.

source: 6. Safari Privacy Settings
sv: 6. Integritetsinställningar för Safari

source: Advanced Tracking and Fingerprinting Protection (NEW in iOS 26)
sv: Avancerat spårnings- och fingeravtrycksskydd (NYTT i iOS 26)

source: iOS 26 expands anti-fingerprinting protection to **all browsing**, not just Private Browsing:
sv: iOS 26 utökar skydd mot fingeravtrycksspårning till **all surfning**, inte bara privat surfning:

source: Go to **Settings > Apps > Safari > Advanced**
sv: Gå till **Inställningar > Appar > Safari > Avancerat**

source: Set **Advanced Tracking and Fingerprinting Protection** to **All Browsing**
sv: Ställ in **Avancerat spårnings- och fingeravtrycksskydd** till **All surfning**

source: This normalizes browser data to make your device look generic to tracking scripts, significantly reducing fingerprinting effectiveness.
sv: Detta normaliserar webbläsardata för att få din enhet att se generisk ut för spårningsskript, vilket avsevärt minskar fingeravtrycksspårningens effektivitet.

source: Private Browsing with Face ID Lock
sv: Privat surfning med Face ID-lås

source: Go to **Settings > Apps > Safari**
sv: Gå till **Inställningar > Appar > Safari**

source: Enable **Require Face ID to Unlock Private Browsing**
sv: Aktivera **Kräv Face ID för att låsa upp privat surfning**

source: Hide IP Address
sv: Dölj IP-adress

source: Go to **Settings > Apps > Safari > Hide IP Address**
sv: Gå till **Inställningar > Appar > Safari > Dölj IP-adress**

source: Choose:
sv: Välj:

source: **Trackers Only** – Hides IP from known trackers
sv: **Endast spårare** – Döljer IP från kända spårare

source: **Trackers and Websites** – Hides IP from all sites (requires iCloud+ Private Relay)
sv: **Spårare och webbplatser** – Döljer IP från alla webbplatser (kräver iCloud+ Privat reläfunktion)

source: Intelligent Tracking Prevention
sv: Intelligent spårningsförebyggande

source: Enable **Prevent Cross-Site Tracking**
sv: Aktivera **Förhindra spårning mellan webbplatser**

source: Fraudulent Website Warning
sv: Varning för bedrägliga webbplatser

source: Enable **Fraudulent Website Warning**
sv: Aktivera **Varning för bedrägliga webbplatser**

source: Link Tracking Protection
sv: Länkspårningsskydd
