Repository: kushaldas/securitybook
Catalog: po/*.po
Languages: sv

source: Backups are encrypted with your screen lock
sv: Säkerhetskopior krypteras med ditt skärmlås

source: SIM Lock
sv: SIM-lås

source: Go to **Settings > Security & Privacy > More security & privacy > SIM lock**
sv: Gå till **Inställningar > Säkerhet och integritet > Mer säkerhet och integritet > SIM-lås**

source: Toggle on **Lock SIM**
sv: Aktivera **Lås SIM**

source: Set a PIN (different from screen lock)
sv: Ställ in en PIN (annorlunda än skärmlås)

source: Repair Mode (Android 16)
sv: Reparationsläge (Android 16)

source: Securely prepare device for repair without exposing data:
sv: Förbered enheten säkert för reparation utan att exponera data:

source: Go to **Settings > System > Repair Mode**
sv: Gå till **Inställningar > System > Reparationsläge**

source: Follow instructions to wipe data while allowing hardware diagnostics
sv: Följ instruktionerna för att radera data samtidigt som hårdvarudiagnostik tillåts

source: Trade-in Mode (Android 16)
sv: Inbytesläge (Android 16)

source: Safely prepare device for resale:
sv: Förbered enheten säkert för återförsäljning:

source: Go to **Settings > System > Trade-in Mode**
sv: Gå till **Inställningar > System > Inbytesläge**

source: Allows buyer to test hardware without accessing personal data
sv: Låter köparen testa hårdvaran utan att komma åt personlig data

source: Advanced Protection
sv: Avancerat skydd

source: Settings > Security & Privacy > Advanced Protection
sv: Inställningar > Säkerhet och integritet > Avancerat skydd

source: Strong Screen Lock
sv: Starkt skärmlås

source: Settings > Security & Privacy > Device Unlock
sv: Inställningar > Säkerhet och integritet > Enhetslås

source: ✅ PIN 6+ digits or password
sv: ✅ PIN 6+ siffror eller lösenord

source: Google Account > Security
sv: Google-konto > Säkerhet

source: Identity Check
sv: Identitetskoll

source: Settings > Security & Privacy > Theft Protection
sv: Inställningar > Säkerhet och integritet > Stöldskydd

source: Settings > Google > Theft Protection
sv: Inställningar > Google > Stöldskydd

source: Play Store > Play Protect
sv: Play Butik > Play Protect

source: ✅ Ensure active
sv: ✅ Säkerställ aktivt

source: Settings > Passwords, passkeys & accounts
sv: Inställningar > Lösenord, nycklar och konton

source: ✅ Use where available
sv: ✅ Använd där tillgängligt

source: App Permissions
sv: Appbehörigheter

source: Settings > Security & Privacy > Permission Manager
sv: Inställningar > Säkerhet och integritet > Behörighetshanterare

source: ⚙️ Review regularly
sv: ⚙️ Granska regelbundet

source: Settings > Location > App permissions
sv: Inställningar > Plats > Appbehörigheter

source: ⚙️ Minimize "All the time"
sv: ⚙️ Minimera "Alltid"

source: Advertising ID
sv: Reklam-ID

source: Settings > Security & Privacy > Ads
sv: Inställningar > Säkerhet och integritet > Annonser

source: ❌ Delete
sv: ❌ Ta bort

source: Settings > Network & internet > SIMs
sv: Inställningar > Nätverk och internet > SIM-kort

source: Find My Device
sv: Hitta min enhet

source: Settings > Security & Privacy > Find My Device
sv: Inställningar > Säkerhet och integritet > Hitta min enhet

source: Unknown Sources
sv: Okända källor

source: Settings > Apps > Install unknown apps
sv: Inställningar > Appar > Installera okända appar

source: ❌ Disable all
sv: ❌ Inaktivera alla

source: Settings > Notifications
sv: Inställningar > Aviseringar

source: ⚙️ Hide sensitive
sv: ⚙️ Dölj känsligt

source: Android 16 represents Google's most comprehensive security update, with Advanced Protection Mode making it easy to enable maximum security with one toggle. Key priorities:
sv: Android 16 representerar Googles mest omfattande säkerhetsuppdatering, där Avancerat skydd gör det enkelt att aktivera maximal säkerhet med en enda omkopplare. Viktiga prioriteringar:

source: **Enable Advanced Protection Mode** – Activates all major security features at once
sv: **Aktivera Avancerat skydd** – Aktiverar alla viktiga säkerhetsfunktioner på en gång

source: **Set up Identity Check** – Protects sensitive settings when away from trusted locations
sv: **Konfigurera Identitetskoll** – Skyddar känsliga inställningar när du är borta från betrodda platser

source: **Enable Theft Protection features** – Theft Detection Lock, Offline Device Lock, Remote Lock
sv: **Aktivera stöldskyddsfunktioner** – Stölddetekteringslås, offlineenhetslås, fjärrlås

source: **Use Passkeys** – More secure than passwords, phishing-resistant
sv: **Använd nycklar** – Säkrare än lösenord, nätfiskeresistenta

source: **Review app permissions regularly** – Revoke unnecessary access
sv: **Granska appbehörigheter regelbundet** – Återkalla onödig åtkomst

source: **Delete your Advertising ID** – Reduces tracking
sv: **Ta bort ditt reklam-ID** – Minskar spårning

source: **Keep software updated** – Security patches are critical
sv: **Håll programvaran uppdaterad** – Säkerhetspatchar är kritiska

source: By configuring these settings, you significantly strengthen your privacy and security against both common threats and sophisticated attacks.
sv: Genom att konfigurera dessa inställningar stärker du avsevärt din integritet och säkerhet mot både vanliga hot och sofistikerade attacker.

source: _Last updated: January 2026 | Applies to Android 16_ _Note: Settings may vary slightly by device manufacturer (Pixel, Samsung, etc.)_
sv: _Senast uppdaterad: januari 2026 | Gäller för Android 16_ _Obs: Inställningar kan variera något beroende på enhetstillverkare (Pixel, Samsung, etc.)_

source: GrapheneOS Security & Privacy Settings Guide
sv: Guide för GrapheneOS säkerhets- och integritetsinställningar

source: Latest Stable Release: 2026012100 (January 21, 2026)
sv: Senaste stabila utgåva: 2026012100 (21 januari 2026)

source: Latest Beta/Alpha Release: 2026012800 (January 28, 2026)
sv: Senaste beta/alfa-utgåva: 2026012800 (28 januari 2026)

source: Based on Android 16 QPR2
sv: Baserad på Android 16 QPR2

source: **Current Version Information:**
sv: **Aktuell versionsinformation:**

source: **Stable Release:** 2026012100 (January 21, 2026)
sv: **Stabil utgåva:** 2026012100 (21 januari 2026)

source: **Beta/Alpha Release:** 2026012800 (January 28, 2026)
sv: **Beta/alfa-utgåva:** 2026012800 (28 januari 2026)

source: **Security Preview:** 2026012801 (includes patches through June 2026 ASB)
sv: **Förhandstitt på säkerhet:** 2026012801 (inkluderar korrigeringar till juni 2026 ASB)

source: **Android Base:** Android 16 QPR2 (BP4A.251205.006)
sv: **Android-bas:** Android 16 QPR2 (BP4A.251205.006)

source: **Kernel Versions:** 6.1.161 (GKI LTS), 6.6 LTS, 6.12.67 LTS
sv: **Kärnversioner:** 6.1.161 (GKI LTS), 6.6 LTS, 6.12.67 LTS

source: **Vanadium Browser:** 144.0.7559.109.0
sv: **Vanadium-webbläsare:** 144.0.7559.109.0

source: 1. Overview
sv: 1. Översikt

source: GrapheneOS is a privacy and security-focused mobile operating system based on the Android Open Source Project (AOSP). It is designed for users who require the highest level of mobile security, including journalists, activists, security researchers, and privacy-conscious individuals. Notably, Edward Snowden has publicly endorsed GrapheneOS as his mobile OS of choice.
sv: GrapheneOS är ett integritet- och säkerhetsfokuserat mobilt operativsystem baserat på Android Open Source Project (AOSP). Det är utformat för användare som kräver den högsta nivån av mobil säkerhet, inklusive journalister, aktivister, säkerhetsforskare och integritetsfokuserade personer. Edward Snowden har offentligt rekommenderat GrapheneOS som sitt föredragna mobila operativsystem.

source: I personally did not verify all details as I am running an older version of GrapheneOS.
sv: Jag har personligen inte verifierat alla detaljer eftersom jag kör en äldre version av GrapheneOS.

source: What's New in 2025-2026
sv: Nyheter 2025–2026

source: **Latest Beta Release (2026012800 - January 28, 2026):**
sv: **Senaste betautgåva (2026012800 - 28 januari 2026):**

source: FusedLocationProvider: Restored pre-16-QPR1 GNSS usage policy (uses GNSS for both balanced and high power requests)
sv: FusedLocationProvider: Återställd GNSS-användningspolicy från före 16-QPR1 (använder GNSS för både balanserade och högeffektförfrågningar)

source: Sandboxed Google Play: Added special case for SMS permission to enable SMS-based authentication for apps using Google Play services
sv: Sandboxat Google Play: Lade till specialfall för SMS-behörighet för att aktivera SMS-baserad autentisering för appar som använder Google Play-tjänster

source: Sandboxed Google Play: Prevented Play Store from attempting to install unnecessary "Device configuration" package
sv: Sandboxat Google Play: Förhindrade Play Butik från att försöka installera onödigt paket "Enhetskonfiguration"

source: Improved secure app spawning compatibility with anti-tampering checks in certain apps
sv: Förbättrad kompatibilitet för säker appstart med anti-manipuleringskontroller i vissa appar

source: Settings: Now requires device restart after changing secure app spawning setting
sv: Inställningar: Kräver nu omstart av enheten efter ändring av inställning för säker appstart

source: Network Location: Renamed "GrapheneOS proxy" to "GrapheneOS Apple proxy" for clarity
sv: Nätverksplats: Döpte om "GrapheneOS-proxy" till "GrapheneOS Apple-proxy" för tydlighet

source: Network Location: Added "Apple China" server choice for China data compliance
sv: Nätverksplats: Lade till serverval "Apple Kina" för Kinas dataefterlevnad

source: Pixel 8a, 9th/10th gen: Disabled NTP usage in Samsung gnssd
sv: Pixel 8a, 9:e/10:e gen: Inaktiverade NTP-användning i Samsung gnssd

source: Improved UI for Network/Sensors permissions in permission manager
sv: Förbättrat gränssnitt för nätverks-/sensorbehörigheter i behörighetshanteraren

source: Fixed Material 3 Expressive styling for Contact/Storage Scopes UI
sv: Åtgärdade Material 3 Expressive-styling för gränssnitt för kontakt-/lagringsomfång

source: Kernel 6.12 updated to 6.12.67
sv: Kärna 6.12 uppdaterad till 6.12.67

source: Vanadium updated to 144.0.7559.109.0
sv: Vanadium uppdaterad till 144.0.7559.109.0

source: **Current Stable Release (2026012100 - January 21, 2026):**
sv: **Aktuell stabil utgåva (2026012100 - 21 januari 2026):**

source: Fixed upstream infinite loop bug in ProtoFieldFilter.skipBytes() causing system unusability in early boot
sv: Åtgärdade uppströms oändlig loop-bugg i ProtoFieldFilter.skipBytes() som orsakade systemoanvändbarhet vid tidig uppstart

source: libpng: Backported security patches
sv: libpng: Bakporterade säkerhetskorrigeringar

source: Removed unused INTERNET permission from Pixel Camera Services
sv: Tog bort oanvänd INTERNET-behörighet från Pixel Camera Services

source: Kernel 6.1 updated to 6.1.161, Kernel 6.12 updated to 6.12.66
sv: Kärna 6.1 uppdaterad till 6.1.161, kärna 6.12 uppdaterad till 6.12.66

source: Vanadium updated through version 144.0.7559.90.0
sv: Vanadium uppdaterad till version 144.0.7559.90.0

source: **Security Preview Release (2026012801):**
sv: **Förhandstitt på säkerhet (2026012801):**

source: Includes patches through June 2026 Android Security Bulletin
sv: Inkluderar korrigeringar till juni 2026 Android Security Bulletin

source: 8 Critical CVEs patched (CVE-2026-0039 through CVE-2026-0049)
sv: 8 kritiska CVE:er korrigerade (CVE-2026-0039 till CVE-2026-0049)

source: 38+ High-severity CVEs patched ahead of public disclosure
sv: 38+ CVE:er med hög allvarlighetsgrad korrigerade innan offentliggörande

source: Enable via Settings > System > System update > Receive security preview releases
sv: Aktivera via Inställningar > System > Systemuppdatering > Ta emot förhandsutgåvor för säkerhet

source: **Recent Major Features:**
sv: **Senaste stora funktioner:**

source: **Android 16 QPR2 base** - Latest security patches and features
sv: **Android 16 QPR2-bas** – Senaste säkerhetskorrigeringar och funktioner

source: **Security Preview Releases** - Get security patches months ahead of public disclosure
sv: **Förhandsutgåvor för säkerhet** – Få säkerhetskorrigeringar månader före offentliggörande

source: **Pixel 10 support** - Full support for Pixel 10 family (no longer experimental as of January 2026)
sv: **Pixel 10-stöd** – Fullt stöd för Pixel 10-familjen (inte längre experimentellt sedan januari 2026)

source: **Private Space integration** - Android 15+ feature fully supported as replacement for work profiles
sv: **Privat utrymme-integrering** – Android 15+-funktion fullt stödd som ersättning för arbetsprofiler

source: **Enhanced memory tagging** - Expanded MTE support for hardware-level memory safety
sv: **Förbättrad minnes-taggning** – Utökat MTE-stöd för minnessäkerhet på hårdvarunivå

source: **Post-quantum cryptography** - Hybrid key exchange in Vanadium browser
sv: **Postkvantkryptografi** – Hybridnyckelutbyte i Vanadium-webbläsaren

source: **Improved VPN leak protection** - Comprehensive protection against all forms of VPN bypasses
sv: **Förbättrat VPN-läckageskydd** – Omfattande skydd mot alla former av VPN-förbigång

source: **OEM partnership announced** - Non-Pixel devices expected Q4 2026 or Q1 2027
sv: **OEM-partnerskap tillkännagivet** – Icke-Pixel-enheter förväntas Q4 2026 eller Q1 2027

source: **Lockscreen widget support** - Enabled in December 2025 release
sv: **Låsskärmswidgetar** – Aktiverat i december 2025-utgåvan

source: Key Differentiators from Stock Android
sv: Viktiga skillnader från vanlig Android

source: Feature
sv: Funktion

source: Stock Android
sv: Vanlig Android

source: Google Services
sv: Google-tjänster

source: Deeply integrated with privileged access
sv: Djupt integrerat med privilegierad åtkomst

source: Optional, fully sandboxed, no special privileges
sv: Valfritt, helt sandboxat, inga speciella privilegier

source: Network Permission
sv: Nätverksbehörighet

source: Not available
sv: Inte tillgängligt

source: Per-app toggle to completely block network
sv: Per app-växling för att helt blockera nätverk

source: Sensors Permission
sv: Sensorbehörighet

source: Limited
sv: Begränsat

source: Per-app toggle for accelerometer, gyroscope, etc.
sv: Per app-växling för accelerometer, gyroskop, etc.

source: Auto-Reboot
sv: Automatisk omstart

source: Configurable 10 min to 72 hours (default: 18 hours)
sv: Konfigurerbar 10 min till 72 timmar (standard: 18 timmar)

source: Duress PIN
sv: Nöd-PIN

source: Instantly wipes device when entered
sv: Raderar omedelbart enheten när den anges

source: USB Protection
sv: USB-skydd

source: Software-only
sv: Endast programvara

source: Hardware + software, blocks data lines
sv: Hårdvara + programvara, blockerar datalinjer

source: Exploit Mitigations
sv: Skydd mot exploatering

source: Hardened malloc, kernel hardening, MTE
sv: Härdad malloc, kärnhärdning, MTE

source: Update Speed
sv: Uppdateringshastighet

source: Monthly patches
sv: Månatliga korrigeringar

source: Security patches months ahead via preview releases
sv: Säkerhetskorrigeringar månader i förväg via förhandsutgåvor

source: 2. Supported Devices
sv: 2. Enheter som stöds

source: GrapheneOS exclusively supports Google Pixel devices due to their hardware security features, including the Titan M2 security chip and hardware-backed attestation.
sv: GrapheneOS stöder exklusivt Google Pixel-enheter på grund av deras hårdvarubasäkerhetsfunktioner, inklusive Titan M2-säkerhetschip och hårdvarubackad attestering.

source: Currently Supported (Full Support)
sv: Stöds för närvarande (fullt stöd)

source: Device
sv: Enhet

source: Codename
sv: Kodnamn

source: Support Until
sv: Stöds till

source: **OEM-unlockable bootloader** - Carrier-locked devices (e.g., Verizon) are NOT supported
sv: **OEM-upplåsbar bootloader** – Operatörslåsta enheter (t.ex. Verizon) stöds INTE

source: **Titan M/M2 security chip** - Required for hardware-based security features
sv: **Titan M/M2-säkerhetschip** – Krävs för hårdvarubaserade säkerhetsfunktioner

source: **Google hardware** - Only official Pixel devices meet security requirements
sv: **Google-hårdvara** – Endast officiella Pixel-enheter uppfyller säkerhetskraven

source: Future Support
sv: Framtida stöd

source: GrapheneOS announced in October 2025 a partnership with a "major Android OEM" to support Snapdragon-powered flagship devices, expected Q4 2026 or Q1 2027.
sv: GrapheneOS tillkännagav i oktober 2025 ett partnerskap med en "stor Android-OEM" för att stödja Snapdragon-drivna flaggskeppsenheter, förväntas Q4 2026 eller Q1 2027.

source: Prerequisites
sv: Förutsättningar

source: Unlocked Pixel device (not carrier-locked)
sv: Upplåst Pixel-enhet (inte operatörslåst)

source: Computer with Chrome/Chromium browser (for web installer)
sv: Dator med Chrome/Chromium-webbläsare (för webbinstallatören)

source: USB cable
sv: USB-kabel

source: Web Installer (Recommended)
sv: Webbinstallatör (rekommenderas)

source: Go to **https://grapheneos.org/install/web**
sv: Gå till **https://grapheneos.org/install/web**

source: Connect your Pixel via USB
sv: Anslut din Pixel via USB

source: Follow on-screen instructions to:
sv: Följ instruktionerna på skärmen för att:

source: Enable OEM unlocking in Developer Options
sv: Aktivera OEM-upplåsning i Utvecklaralternativ

source: Unlock the bootloader
sv: Lås upp bootloadern

source: Flash GrapheneOS
sv: Flasha GrapheneOS

source: Lock the bootloader (critical for security)
sv: Lås bootloadern (kritiskt för säkerheten)

source: Important Notes
sv: Viktiga noteringar

source: **Always lock the bootloader after installation** - An unlocked bootloader defeats security
sv: **Lås alltid bootloadern efter installation** – En olåst bootloader underminerar säkerheten

source: Installation takes approximately 10-15 minutes
sv: Installationen tar cirka 10–15 minuter

source: All data will be erased during installation
sv: All data kommer att raderas under installationen

source: The web installer prevents bricking - it's very safe
sv: Webbinstallatören förhindrar brickande – det är mycket säkert

source: 4. Initial Setup
sv: 4. Första konfiguration

source: Setup Wizard Security Features
sv: Konfigurationsguidens säkerhetsfunktioner

source: GrapheneOS's Setup Wizard includes enhanced security checks:
sv: GrapheneOS konfigurationsguide inkluderar förbättrade säkerhetskontroller:

source: **Bootloader Warning** - Alerts if bootloader is unlocked with option to reboot to fastboot
sv: **Bootloader-varning** – Varnar om bootloadern är olåst med alternativ att starta om till fastboot

source: **OEM Unlocking Auto-Disable** - Disables OEM unlocking at end of setup (toggle to opt-out)
sv: **Automatisk inaktivering av OEM-upplåsning** – Inaktiverar OEM-upplåsning i slutet av konfigurationen (växla för att avstå)

source: Recommended Initial Configuration
sv: Rekommenderad första konfiguration

source: After completing basic setup:
sv: Efter att ha slutfört grundläggande konfiguration:

source: **Set a strong lock method**
sv: **Ställ in en stark låsmetod**

source: Settings > Security & privacy > Device unlock > Screen lock
sv: Inställningar > Säkerhet och integritet > Enhetslås > Skärmlås

source: Use a strong password (16+ characters) or secure PIN (6+ digits)
sv: Använd ett starkt lösenord (16+ tecken) eller säker PIN-kod (6+ siffror)

source: Consider enabling **Scramble PIN input layout**
sv: Överväg att aktivera **Blanda om PIN-inmatningslayout**

source: **Configure fingerprint with 2FA PIN** (optional)
sv: **Konfigurera fingeravtryck med 2FA-PIN** (valfritt)

source: Adds requirement to enter short PIN after fingerprint
sv: Lägger till krav på att ange kort PIN efter fingeravtryck

source: Provides strong passphrase security with fingerprint convenience
sv: Ger stark lösenfras-säkerhet med fingeravtryckets bekvämlighet

source: **Enable Duress PIN/Password**
sv: **Aktivera nöd-PIN/lösenord**

source: Settings > Security & privacy > Device unlock > Duress Password
sv: Inställningar > Säkerhet och integritet > Enhetslås > Nödlösenord

source: Set BOTH a duress PIN and password
sv: Ställ in BÅDE en nöd-PIN och ett nödlösenord

source: This will wipe the device instantly when entered
sv: Detta kommer att radera enheten omedelbart när det anges

source: **Review exploit protection defaults**
sv: **Granska standardinställningar för exploateringsskydd**

source: Settings > Security & privacy > Exploit protection
sv: Inställningar > Säkerhet och integritet > Exploateringsskydd

source: Default settings are secure; customize as needed
sv: Standardinställningarna är säkra; anpassa efter behov

source: 5. Device Unlock & Authentication
sv: 5. Enhetslås och autentisering

source: **Location:** Settings > Security & privacy > Device unlock > Screen lock
sv: **Plats:** Inställningar > Säkerhet och integritet > Enhetslås > Skärmlås

source: Method
sv: Metod

source: Security Level
sv: Säkerhetsnivå

source: Password
sv: Lösenord

source: Highest
sv: Högst

source: Up to 128 characters (vs 16 on stock Android)
sv: Upp till 128 tecken (mot 16 på vanlig Android)

source: High
sv: Hög

source: Use 6+ random digits
sv: Använd 6+ slumpmässiga siffror

source: Pattern
sv: Mönster

source: Medium
sv: Medel

source: Not recommended
sv: Rekommenderas inte

source: None
sv: Ingen

source: Never use
sv: Använd aldrig

source: PIN Scrambling
sv: PIN-blandning

source: **Location:** Settings > Security & privacy > Device unlock > Scramble PIN input layout
sv: **Plats:** Inställningar > Säkerhet och integritet > Enhetslås > Blanda om PIN-inmatningslayout

source: Randomizes keypad layout each time
sv: Slätar om knappsatslayouten varje gång

source: Prevents shoulder-surfing and smudge attacks
sv: Förhindrar axelkikande och fläckattacker

source: Recommended: **Enable**
sv: Rekommenderat: **Aktivera**

source: Two-Factor Fingerprint Unlock
sv: Tvåfaktors-fingeravtrycksupplåsning

source: **Location:** Settings > Security & privacy > Device unlock
sv: **Plats:** Inställningar > Säkerhet och integritet > Enhetslås

source: When enabled:
sv: När aktiverat:

source: Authenticate with fingerprint
sv: Autentisera med fingeravtryck

source: Then enter a short PIN to complete unlock
sv: Ange sedan en kort PIN för att slutföra upplåsningen

source: Use a strong passphrase as primary unlock
sv: Använd en stark lösenfras som primär upplåsning

source: Convenience of fingerprint + short PIN for daily use
sv: Bekvämligheten med fingeravtryck + kort PIN för daglig användning

source: Failed PIN attempts count toward lockout limit
sv: Misslyckade PIN-försök räknas mot utlåsningsgränsen

source: Duress PIN/Password
sv: Nöd-PIN/lösenord

source: **Location:** Settings > Security & privacy > Device unlock > Duress Password
sv: **Plats:** Inställningar > Säkerhet och integritet > Enhetslås > Nödlösenord

source: **Both** a duress PIN and password are required
sv: **Både** en nöd-PIN och ett lösenord krävs

source: When entered **anywhere** credentials are requested (lockscreen, settings prompts):
sv: När det anges **var som helst** där inloggningsuppgifter begärs (låsskärm, inställningsdialoger):

source: Device is **immediately and irreversibly wiped**
sv: Enheten **raderas omedelbart och oåterkalleligt**

source: All installed eSIMs are wiped
sv: Alla installerade eSIM raderas

source: Wipe cannot be interrupted
sv: Raderingen kan inte avbrytas

source: Device is NOT bricked - can reinstall GrapheneOS
sv: Enheten är INTE brickad – kan ominstallera GrapheneOS

source: **Critical Rules:**
sv: **Kritiska regler:**

source: If duress PIN equals your real PIN, the real PIN takes precedence (no wipe)
sv: Om nöd-PIN är samma som din riktiga PIN har den riktiga PIN företräde (ingen radering)

source: Check local laws regarding evidence destruction before using
sv: Kontrollera lokala lagar gällande bevismaterials förstöring innan användning

source: Do NOT use simple sequences like 1234 that others might guess
sv: Använd INTE enkla sekvenser som 1234 som andra kan gissa
