Repository: kushaldas/securitybook
Catalog: po/*.po
Languages: sv

source: **Option 1: Owner profile** - Simplest, all apps can use Play services
sv: **Alternativ 1: Ägarprofil** – Enklast, alla appar kan använda Play-tjänster

source: **Option 2: Separate profile** - Install Play in secondary profile for isolation:
sv: **Alternativ 2: Separat profil** – Installera Play i sekundär profil för isolering:

source: Create secondary user
sv: Skapa sekundär användare

source: Install sandboxed Google Play there
sv: Installera sandlåde-Google Play där

source: Install apps needing Play services there
sv: Installera appar som behöver Play-tjänster där

source: Keep main profile Google-free
sv: Håll huvudprofilen Google-fri

source: What Works
sv: Vad som fungerar

source: App installations and updates
sv: Appinstallationer och uppdateringar

source: In-app purchases
sv: Köp i appen

source: Push notifications (with battery exception)
sv: Push-aviseringar (med batteriundantag)

source: Play Games services
sv: Play Games-tjänster

source: Most apps requiring Play services
sv: De flesta appar som kräver Play-tjänster

source: Revoking Permissions
sv: Återkalla behörigheter

source: You can revoke ANY permission from Google Play services:
sv: Du kan återkalla VILKEN behörighet som helst från Google Play-tjänster:

source: Location, Contacts, Camera, etc.
sv: Plats, Kontakter, Kamera, etc.

source: May break specific functionality but app won't crash
sv: Kan bryta specifik funktionalitet men appen kraschar inte

source: 16. GrapheneOS Apps
sv: 16. GrapheneOS-appar

source: GrapheneOS includes privacy and security-focused alternatives to standard apps.
sv: GrapheneOS inkluderar integritets- och säkerhetsfokuserade alternativ till standardappar.

source: Apps (App Store)
sv: Appar (Appbutik)

source: The GrapheneOS app repository:
sv: GrapheneOS appförråd:

source: Updates GrapheneOS apps
sv: Uppdaterar GrapheneOS-appar

source: Provides sandboxed Google Play installation
sv: Tillhandahåller sandlåde-Google Play-installation

source: Will distribute hardened open-source apps in future
sv: Kommer distribuera härdade öppen källkod-appar i framtiden

source: Vanadium Browser
sv: Vanadium-webbläsare

source: Hardened Chromium-based browser with:
sv: Härdad Chromium-baserad webbläsare med:

source: **Security Features:**
sv: **Säkerhetsfunktioner:**

source: Hardware memory tagging (MTE)
sv: Hårdvaruminnesmtaggning (MTE)

source: Type-based Control Flow Integrity (CFI)
sv: Typbaserad kontrollflödesintegritet (CFI)

source: JavaScript JIT disabled by default (per-site toggle)
sv: JavaScript JIT inaktiverat som standard (per-webbplats växling)

source: Dynamic code execution blocked for non-JIT processes
sv: Dynamisk kodkörning blockerad för icke-JIT-processer

source: Strict site isolation
sv: Strikt webbplatsisolering

source: **Privacy Features:**
sv: **Integritetsfunktioner:**

source: Built-in ad/tracker blocking (EasyList + EasyPrivacy)
sv: Inbyggd annons/spårningsblockering (EasyList + EasyPrivacy)

source: Third-party cookies disabled by default
sv: Tredjepartskakor inaktiverade som standard

source: Enhanced state partitioning
sv: Förbättrad tillståndspartitionering

source: Reduced user agent / client hints
sv: Reducerad user agent / klientledtrådar

source: DuckDuckGo default search
sv: DuckDuckGo som standardsökmotor

source: **Configuration:**
sv: **Konfiguration:**

source: JIT: Disabled by default, enable per-site via address bar menu
sv: JIT: Inaktiverat som standard, aktivera per webbplats via adressfältsmeny

source: Content filtering: Enabled by default, toggle per-site
sv: Innehållsfiltrering: Aktiverat som standard, växla per webbplats

source: Hardware-based attestation app:
sv: Hårdvarubaserad attesteringsapp:

source: **Purpose:**
sv: **Syfte:**

source: Verify device authenticity and integrity
sv: Verifiera enhetens äkthet och integritet

source: Detect bootloader unlocking or OS tampering
sv: Upptäck upplåsning av bootloader eller OS-manipulering

source: Monitor for security regressions
sv: Övervaka för säkerhetsregressioner

source: **Setup:**
sv: **Konfiguration:**

source: Use another device as "Auditor"
sv: Använd en annan enhet som "Auditor"

source: On device to verify, open Auditor > Auditee
sv: På enheten som ska verifieras, öppna Auditor > Auditee

source: Scan QR code with Auditor device
sv: Skanna QR-kod med Auditor-enheten

source: Optionally set up remote attestation at attestation.app
sv: Konfigurera valfritt fjärrattestering på attestation.app

source: Secure Camera
sv: Säker kamera

source: Privacy-focused camera app:
sv: Integritetsfokuserad kameraapp:

source: EXIF metadata stripped by default
sv: EXIF-metadata borttaget som standard

source: Location tagging disabled by default
sv: Platstaggar inaktiverat som standard

source: No unnecessary permissions
sv: Inga onödiga behörigheter

source: Open source
sv: Öppen källkod

source: Secure PDF Viewer
sv: Säker PDF-visare

source: Sandboxed PDF viewer:
sv: Sandlåde-PDF-visare:

source: Isolated rendering
sv: Isolerad rendering

source: Protection against malicious PDFs
sv: Skydd mot skadliga PDF:er

source: Pinch to zoom, text selection
sv: Nyp för att zooma, textmarkering

source: Encrypted PDF support
sv: Stöd för krypterade PDF:er

source: 17. Backup & Encryption
sv: 17. Säkerhetskopiering och kryptering

source: Seedvault Encrypted Backup
sv: Seedvault krypterad säkerhetskopiering

source: **Location:** Settings > System > Backup
sv: **Plats:** Inställningar > System > Säkerhetskopiering

source: GrapheneOS includes Seedvault for encrypted backups.
sv: GrapheneOS inkluderar Seedvault för krypterade säkerhetskopior.

source: End-to-end encryption
sv: Änd-till-änd-kryptering

source: Local backup support
sv: Lokalt säkerhetskopieringsstöd

source: Cloud storage support (any provider with storage app)
sv: Molnlagringsstöd (vilken leverantör som helst med lagringsapp)

source: Settings > System > Backup
sv: Inställningar > System > Säkerhetskopiering

source: Choose backup location
sv: Välj säkerhetskopieringsplats

source: Set encryption password
sv: Ställ in krypteringslösenord

source: Select apps to back up
sv: Välj appar att säkerhetskopiera

source: Full-Disk Encryption
sv: Full diskkryptering

source: GrapheneOS uses Android's file-based encryption with enhancements:
sv: GrapheneOS använder Androids filbaserade kryptering med förbättringar:

source: 32-byte file name padding (vs 16 bytes)
sv: 32-byte filnamnsutfyllnad (jämfört med 16 bytes)

source: Per-profile encryption keys
sv: Krypteringsnycklar per profil

source: Hardware-backed key storage (Titan M2)
sv: Hårdvarustödd nyckellagring (Titan M2)

source: Data at Rest
sv: Data i vila

source: **Before First Unlock (BFU):**
sv: **Före första upplåsning (BFU):**

source: Most data encrypted and inaccessible
sv: Mesta data krypterad och otillgänglig

source: Only critical functions available
sv: Endast kritiska funktioner tillgängliga

source: **After First Unlock (AFU):**
sv: **Efter första upplåsning (AFU):**

source: Credential-encrypted data accessible
sv: Inloggningsuppgiftskrypterad data tillgänglig

source: Auto-reboot returns device to BFU state
sv: Automatisk omstart återställer enheten till BFU-tillstånd

source: 18. System Updates
sv: 18. Systemuppdateringar

source: **Location:** Settings > System > System update
sv: **Plats:** Inställningar > System > Systemuppdatering

source: GrapheneOS provides seamless automatic updates:
sv: GrapheneOS tillhandahåller sömlösa automatiska uppdateringar:

source: Downloads in background
sv: Laddar ner i bakgrunden

source: Installs without interrupting usage
sv: Installerar utan att avbryta användning

source: Automatic rollback if update fails
sv: Automatisk återställning om uppdatering misslyckas

source: A/B partition system for safety
sv: A/B-partitionssystem för säkerhet

source: Security Preview Releases
sv: Säkerhetsförhandsversioner

source: **Location:** Settings > System > System update > Receive security preview releases
sv: **Plats:** Inställningar > System > Systemuppdatering > Ta emot säkerhetsförhandsversioner

source: Get security patches **months before** public disclosure
sv: Få säkerhetskorrigeringar **månader före** offentlig publicering

source: Currently includes patches through June 2026 ASB
sv: Inkluderar för närvarande korrigeringar till och med juni 2026 ASB

source: Same stability as regular releases
sv: Samma stabilitet som vanliga versioner

source: **How It Works:**
sv: **Så fungerar det:**

source: GrapheneOS participates in Android security embargo
sv: GrapheneOS deltar i Androids säkerhetsembargo

source: Can ship patches before disclosure (unlike stock OS)
sv: Kan leverera korrigeringar före publicering (till skillnad från standard-OS)

source: Preview releases increment build number by 1
sv: Förhandsversioner ökar buildnummer med 1

source: **Recommendation:** Enable for maximum security
sv: **Rekommendation:** Aktivera för maximal säkerhet

source: Update Frequency
sv: Uppdateringsfrekvens

source: **Regular releases:** Within days of Android security bulletin
sv: **Vanliga versioner:** Inom dagar från Android-säkerhetsbuletinen

source: **Preview releases:** Months ahead of disclosure
sv: **Förhandsversioner:** Månader före publicering

source: **Feature updates:** As developed
sv: **Funktionsuppdateringar:** Efter utveckling

source: 19. Advanced Settings
sv: 19. Avancerade inställningar

source: Connectivity Checks
sv: Anslutningskontroller

source: Controls which server verifies internet connectivity:
sv: Styr vilken server som verifierar internetanslutning:

source: GrapheneOS (default, private)
sv: GrapheneOS (standard, privat)

source: Standard Android (Google, for blending in)
sv: Standard-Android (Google, för att smala in)

source: Disabled
sv: Inaktiverad

source: Attestation Provisioning
sv: Attesteringsprovisionering

source: Controls attestation key provisioning:
sv: Styr attesteringsnyckel-provisionering:

source: GrapheneOS proxy (default, private)
sv: GrapheneOS-proxy (standard, privat)

source: Direct (Google)
sv: Direkt (Google)

source: GNSS / Location
sv: GNSS / Plats

source: **Network Location:**
sv: **Nätverksplats:**

source: GrapheneOS provides opt-in network location
sv: GrapheneOS tillhandahåller opt-in nätverksplats

source: Uses proxy to Apple's service (or direct)
sv: Använder proxy till Apples tjänst (eller direkt)

source: Building own database for future offline support
sv: Bygger egen databas för framtida offline-stöd

source: **SUPL (Assisted GPS):**
sv: **SUPL (Assisterad GPS):**

source: Proxied through GrapheneOS by default
sv: Proxad genom GrapheneOS som standard

source: Can switch to carrier default or disable
sv: Kan växla till operatörsstandard eller inaktivera

source: Clipboard Privacy
sv: Urklippsintegritet

source: **Location:** Settings > Security & privacy > Privacy controls > Show clipboard access
sv: **Plats:** Inställningar > Säkerhet och integritet > Integritetskontroller > Visa urklippsåtkomst

source: Shows notification when apps access clipboard content from other apps.
sv: Visar avisering när appar kommer åt urklippsinnehåll från andra appar.

source: Privacy Indicators
sv: Integritetsindikatorer

source: GrapheneOS enables location indicator (in addition to camera/mic):
sv: GrapheneOS aktiverar platsindikator (utöver kamera/mikrofon):

source: Green dot shows when any app accesses location
sv: Grön prick visas när någon app kommer åt plats

source: Works for all location APIs (not just GNSS)
sv: Fungerar för alla plats-API:er (inte bara GNSS)

source: Accessibility Warning
sv: Varning för tillgänglighet

source: **NEVER grant Accessibility permission** unless absolutely required:
sv: **GE ALDRIG tillgänglighetsbehörighet** om det inte är absolut nödvändigt:

source: Extremely dangerous permission
sv: Extremt farlig behörighet

source: Can read all screen content
sv: Kan läsa allt skärminnehåll

source: Can perform actions on your behalf
sv: Kan utföra åtgärder på dina vägnar

source: 20. Quick Reference Checklist
sv: 20. Snabbreferens-checklista

source: Essential Security Settings
sv: Väsentliga säkerhetsinställningar

source: **Lock bootloader** after installation
sv: **Lås bootloader** efter installation

source: **Strong password/PIN** - 6+ digit PIN or 16+ char password
sv: **Starkt lösenord/PIN** – 6+ siffrig PIN eller 16+ tecken lösenord

source: **Enable Scramble PIN** - Settings > Security & privacy > Device unlock
sv: **Aktivera Blanda PIN** – Inställningar > Säkerhet och integritet > Enhetslås

source: **Set Duress PIN/Password** - Both required
sv: **Ange Tvungs-PIN/lösenord** – Båda krävs

source: **Auto-reboot: 8-18 hours** - Settings > Security & privacy > Exploit protection
sv: **Automatisk omstart: 8–18 timmar** – Inställningar > Säkerhet och integritet > Exploateringsskydd

source: **USB-C: Charging-only when locked** (default)
sv: **USB-C: Endast laddning när låst** (standard)

source: **Wi-Fi/Bluetooth auto-off: 10 minutes**
sv: **Wi-Fi/Bluetooth auto-av: 10 minuter**

source: **Enable VPN with lockdown** - Block connections without VPN
sv: **Aktivera VPN med låsning** – Blockera anslutningar utan VPN

source: **Enable Security Preview releases** - Get patches early
sv: **Aktivera Säkerhetsförhandsversioner** – Få korrigeringar tidigt

source: **Disable Wi-Fi/Bluetooth scanning** - Settings > Location
sv: **Inaktivera Wi-Fi/Bluetooth-skanning** – Inställningar > Plats

source: **Use per-connection MAC randomization** (default)
sv: **Använd MAC-randomisering per anslutning** (standard)

source: **Set generic Bluetooth name** - "Device"
sv: **Sätt generiskt Bluetooth-namn** – "Enhet"

source: **Use Private DNS** - Quad9 or similar
sv: **Använd Privat DNS** – Quad9 eller liknande

source: **GrapheneOS connectivity checks** (default)
sv: **GrapheneOS anslutningskontroller** (standard)

source: **Review app Network permissions** - Deny where not needed
sv: **Granska appars nätverksbehörigheter** – Neka där det inte behövs

source: **Enable Sensors deny by default** - Settings > Security & privacy
sv: **Aktivera Sensorer neka som standard** – Inställningar > Säkerhet och integritet

source: Per-App Best Practices
sv: Bästa praxis per app

source: **Deny Network** for apps that don't need internet
sv: **Neka nätverk** för appar som inte behöver internet

source: **Deny Sensors** for apps that don't need motion data
sv: **Neka sensorer** för appar som inte behöver rörelsedata

source: **Use Storage Scopes** instead of full storage access
sv: **Använd Lagringsomfång** istället för full lagråtkomst

source: **Use Contact Scopes** instead of full contacts access
sv: **Använd Kontaktomfång** istället för full kontaktåtkomst

source: **Disable native debugging** - Settings > Security & privacy > Exploit protection
sv: **Inaktivera nativ felsökning** – Inställningar > Säkerhet och integritet > Exploateringsskydd

source: **Review all permissions** after installation
sv: **Granska alla behörigheter** efter installation

source: Advanced Hardening
sv: Avancerad härdning

source: **Separate profile for Google Play** - Isolate from main profile
sv: **Separat profil för Google Play** – Isolera från huvudprofil

source: **Use Private Space** for sensitive apps
sv: **Använd Privat utrymme** för känsliga appar

source: **Enable Auditor remote attestation** - attestation.app
sv: **Aktivera Auditor fjärrattestering** – attestation.app

source: **Disable all dynamic code loading** for apps that don't need it
sv: **Inaktivera all dynamisk kodladdning** för appar som inte behöver det

source: **Set auto-reboot to minimum tolerable** (4-8 hours for high security)
sv: **Ställ in automatisk omstart till minimum tolererbar** (4–8 timmar för hög säkerhet)

source: **Consider Charging-only USB** if you never use data transfer
sv: Överväg **USB endast laddning** om du aldrig använder dataöverföring

source: Additional Resources
sv: Ytterligare resurser

source: **Official Documentation:** https://grapheneos.org
sv: **Officiell dokumentation:** https://grapheneos.org

source: **Features Overview:** https://grapheneos.org/features
sv: **Funktionsöversikt:** https://grapheneos.org/features

source: **Usage Guide:** https://grapheneos.org/usage
sv: **Användarguide:** https://grapheneos.org/usage

source: **FAQ:** https://grapheneos.org/faq
sv: **Vanliga frågor:** https://grapheneos.org/faq

source: **Releases:** https://grapheneos.org/releases
sv: **Versioner:** https://grapheneos.org/releases

source: **Discussion Forum:** https://discuss.grapheneos.org
sv: **Diskussionsforum:** https://discuss.grapheneos.org

source: **Document Information:**
sv: **Dokumentinformation:**

source: _Last Updated: January 31, 2026_
sv: _Senast uppdaterad: 31 januari 2026_

source: _GrapheneOS Stable Release: 2026012100 (January 21, 2026)_
sv: _GrapheneOS stabil version: 2026012100 (21 januari 2026)_

source: _GrapheneOS Beta Release: 2026012800 (January 28, 2026)_
sv: _GrapheneOS betaversion: 2026012800 (28 januari 2026)_

source: _Android Base: Android 16 QPR2 (BP4A.251205.006)_
sv: _Android-bas: Android 16 QPR2 (BP4A.251205.006)_

source: _Vanadium Browser: 144.0.7559.109.0_
sv: _Vanadium-webbläsare: 144.0.7559.109.0_

source: _Supported Devices: Pixel 6 through Pixel 10 families_
sv: _Enheter som stöds: Pixel 6 till Pixel 10-familjerna_

source: _GrapheneOS is under active development. Security preview releases provide patches months ahead of public disclosure (currently through June 2026). Check official documentation at grapheneos.org for the latest features and recommendations._
sv: _GrapheneOS är under aktiv utveckling. Säkerhetsförhandsversioner tillhandahåller korrigeringar månader före offentlig publicering (för närvarande till och med juni 2026). Kontrollera officiell dokumentation på grapheneos.org för de senaste funktionerna och rekommendationerna._
