Repository: kushaldas/securitybook
Catalog: po/*.po
Languages: sv

source: Android automatically resets permissions for apps you haven't used in a while.
sv: Android återställer automatiskt behörigheter för appar du inte har använt på ett tag.

source: Go to **Settings > Apps > \[App name\] > Permissions**
sv: Gå till **Inställningar > Appar > \[Appnamn\] > Behörigheter**

source: Ensure **Pause app activity if unused** is enabled
sv: Se till att **Pausa appaktivitet om oanvänd** är aktiverat

source: AI-Powered Permission Controls (Android 16)
sv: AI-drivna behörighetskontroller (Android 16)

source: Android 16 introduces contextual permission management:
sv: Android 16 introducerar kontextbaserad behörighetshantering:

source: System evaluates if permission requests match your usage patterns
sv: Systemet utvärderar om behörighetsförfrågningar matchar dina användningsmönster

source: Unusual requests (e.g., location at midnight) may trigger additional confirmation
sv: Ovanliga förfrågningar (t.ex. plats vid midnatt) kan utlösa ytterligare bekräftelse

source: Detailed permission logs explain automated decisions
sv: Detaljerade behörighetsloggar förklarar automatiserade beslut

source: Local Network Protection (New in Android 16)
sv: Lokalt nätverksskydd (nytt i Android 16)

source: Apps now need explicit permission to access your local network (smart home devices, etc.):
sv: Appar behöver nu uttryckligt tillstånd för att komma åt ditt lokala nätverk (smarta hemenheter, etc.):

source: Review **Nearby devices** and **Local network** permissions
sv: Granska behörigheter för **Enheter i närheten** och **Lokalt nätverk**

source: 6. Location Services
sv: 6. Platstjänster

source: Global Location Settings
sv: Globala platsinställningar

source: Go to **Settings > Location**
sv: Gå till **Inställningar > Plats**

source: Toggle **Use location** on or off
sv: Aktivera eller inaktivera **Använd plats**

source: Per-App Location Permissions
sv: Platsbehörigheter per app

source: Go to **Settings > Location > App location permissions**
sv: Gå till **Inställningar > Plats > Appplatsbehörigheter**

source: **Allowed all the time**
sv: **Tillåten alltid**

source: **Allowed only while using**
sv: **Tillåten endast vid användning**

source: **Ask every time**
sv: **Fråga varje gång**

source: **Not allowed**
sv: **Inte tillåten**

source: Android 16 fixes a flaw that allowed apps to infer precise location even with approximate permission.
sv: Android 16 åtgärdar en brist som tillät appar att härleda exakt plats även med ungefärlig behörighet.

source: Go to **Settings > Location > App location permissions > \[App\]**
sv: Gå till **Inställningar > Plats > Appplatsbehörigheter > \[App\]**

source: Toggle **Use precise location** off for apps that don't need exact coordinates
sv: Inaktivera **Använd exakt plats** för appar som inte behöver exakta koordinater

source: Location History
sv: Platshistorik

source: Go to **Settings > Google > Manage your Google Account > Data & privacy**
sv: Gå till **Inställningar > Google > Hantera ditt Google-konto > Data och integritet**

source: Under "History settings," review **Location History**
sv: Under "Historikinställningar" granskar du **Platshistorik**

source: Turn off or set auto-delete (3 months, 18 months, 36 months)
sv: Stäng av eller ställ in automatisk radering (3 månader, 18 månader, 36 månader)

source: 7. Private Space
sv: 7. Privat utrymme

source: Private Space lets you hide and secure sensitive apps behind a separate authentication.
sv: Privat utrymme låter dig dölja och säkra känsliga appar bakom en separat autentisering.

source: Hidden apps in a separate space
sv: Dolda appar i ett separat utrymme

source: Separate Google account for private apps
sv: Separat Google-konto för privata appar

source: Requires PIN/biometric to access
sv: Kräver PIN/biometri för åtkomst

source: Apps don't appear in app drawer, search, or notifications
sv: Appar visas inte i applådan, sökning eller notifikationer

source: How to Set Up
sv: Så här konfigurerar du

source: Go to **Settings > Security & Privacy > Private Space**
sv: Gå till **Inställningar > Säkerhet och integritet > Privat utrymme**

source: Create or sign into a Google account for Private Space
sv: Skapa eller logga in på ett Google-konto för Privat utrymme

source: Set up lock (PIN, pattern, or password)
sv: Ställ in lås (PIN, mönster eller lösenord)

source: Adding Apps to Private Space
sv: Lägga till appar i Privat utrymme

source: Open Private Space (swipe up and scroll to bottom of app list)
sv: Öppna Privat utrymme (svep uppåt och scrolla till botten av applistan)

source: Tap **Install apps**
sv: Tryck på **Installera appar**

source: Install or move apps to Private Space
sv: Installera eller flytta appar till Privat utrymme

source: Use Private Space for:
sv: Använd Privat utrymme för:

source: Banking and financial apps
sv: Bank- och finansappar

source: Personal health apps
sv: Personliga hälsoappar

source: Sensitive documents
sv: Känsliga dokument

source: Apps you want to keep private
sv: Appar du vill hålla privata

source: Play Protect scans your device for harmful apps.
sv: Play Protect söker igenom din enhet efter skadliga appar.

source: Automatic app scanning
sv: Automatisk appskanning

source: Real-time threat protection
sv: Hotskydd i realtid

source: Identifies harmful apps and malware
sv: Identifierar skadliga appar och skadlig programvara

source: Cannot be disabled when Advanced Protection is on
sv: Kan inte inaktiveras när Avancerat skydd är på

source: How to Check Status
sv: Så här kontrollerar du status

source: Open **Google Play Store**
sv: Öppna **Google Play Butik**

source: Tap your profile icon
sv: Tryck på din profilikon

source: Tap **Play Protect**
sv: Tryck på **Play Protect**

source: Tap **Scan** to run manual scan
sv: Tryck på **Sök** för att köra manuell sökning

source: Settings
sv: Inställningar

source: In Play Protect, tap **Settings** (gear icon)
sv: I Play Protect, tryck på **Inställningar** (kugghjulsikonen)

source: Ensure **Scan apps with Play Protect** is on
sv: Se till att **Sök igenom appar med Play Protect** är aktiverat

source: Enable **Improve harmful app detection** to send unknown apps to Google
sv: Aktivera **Förbättra upptäckt av skadliga appar** för att skicka okända appar till Google

source: Live Threat Protection (Android 16)
sv: Realtidshotskydd (Android 16)

source: Enhanced scanning detects apps that:
sv: Förbättrad skanning upptäcker appar som:

source: Change their icon to hide
sv: Ändrar sin ikon för att dölja sig

source: Attempt to evade detection
sv: Försöker undvika upptäckt

source: Show malicious behavior
sv: Visar skadligt beteende

source: Available on Pixel 6+ and newer devices from other manufacturers.
sv: Tillgängligt på Pixel 6+ och nyare enheter från andra tillverkare.

source: 9. Google Password Manager & Passkeys
sv: 9. Googles lösenordshanterare och nycklar

source: Google Password Manager
sv: Googles lösenordshanterare

source: Built-in password manager that syncs across devices.
sv: Inbyggd lösenordshanterare som synkroniserar mellan enheter.

source: **How to access:**
sv: **Så här kommer du åt:**

source: Go to **Settings**
sv: Gå till **Inställningar**

source: Search for **Password Manager**
sv: Sök efter **Lösenordshanterare**

source: Or open the **Passwords** app
sv: Eller öppna appen **Lösenord**

source: **Features:**
sv: **Funktioner:**

source: Save and autofill passwords
sv: Spara och autofyll lösenord

source: Generate strong passwords
sv: Generera starka lösenord

source: Password checkup (finds weak, reused, compromised passwords)
sv: Lösenordskontroll (hittar svaga, återanvända, komprometterade lösenord)

source: Syncs to Google Account
sv: Synkroniserar till Google-konto

source: Passkeys
sv: Nycklar

source: Passkeys are phishing-resistant replacements for passwords.
sv: Nycklar är nätfiskeresistenta ersättningar för lösenord.

source: **Benefits:**
sv: **Fördelar:**

source: More secure than passwords
sv: Säkrare än lösenord

source: Cannot be phished
sv: Kan inte nätfiskas

source: Synced across devices via Google Password Manager
sv: Synkroniseras mellan enheter via Googles lösenordshanterare

source: Authenticate with fingerprint, face, or PIN
sv: Autentisera med fingeravtryck, ansikte eller PIN

source: **How to use passkeys:**
sv: **Så här använder du nycklar:**

source: When a site/app supports passkeys, you'll be prompted to create one
sv: När en webbplats/app stöder nycklar blir du ombedd att skapa en

source: Confirm with your screen lock (fingerprint, face, PIN)
sv: Bekräfta med ditt skärmlås (fingeravtryck, ansikte, PIN)

source: Passkey is saved to Google Password Manager
sv: Nyckeln sparas i Googles lösenordshanterare

source: Sign in using your device's biometric/PIN
sv: Logga in med din enhets biometri/PIN

source: **Automatic Passkey Creation (Android 16):**
sv: **Automatisk nyckelskapande (Android 16):**

source: When you sign in with a password, Android can automatically create a passkey for future use
sv: När du loggar in med ett lösenord kan Android automatiskt skapa en nyckel för framtida användning

source: **Restore Credentials (Android 16):**
sv: **Återställ autentiseringsuppgifter (Android 16):**

source: When setting up a new device, passkeys and app credentials transfer automatically
sv: När du konfigurerar en ny enhet överförs nycklar och appautentiseringsuppgifter automatiskt

source: Go to **Settings > Passwords, passkeys & accounts**
sv: Gå till **Inställningar > Lösenord, nycklar och konton**

source: Configure your password manager
sv: Konfigurera din lösenordshanterare

source: Enable **Offer to save passwords**
sv: Aktivera **Erbjud att spara lösenord**

source: Enable **Automatically create a passkey to sign in faster**
sv: Aktivera **Skapa automatiskt en nyckel för snabbare inloggning**

source: 10. Scam & Spam Protection
sv: 10. Bedrägeri- och skräppostskydd

source: In-Call Protection (Android 16)
sv: Skydd under samtal (Android 16)

source: Blocks dangerous actions during calls with non-contacts:
sv: Blockerar farliga åtgärder under samtal med icke-kontakter:

source: Cannot sideload apps for the first time
sv: Kan inte installera appar från okända källor för första gången

source: Cannot disable Google Play Protect
sv: Kan inte inaktivera Google Play Protect

source: Cannot grant accessibility permissions
sv: Kan inte bevilja tillgänglighetsbehörigheter

source: Screen-sharing reminder when call ends
sv: Påminnelse om skärmdelning när samtalet avslutas

source: Scam Detection in Phone App
sv: Bedrägeridetektering i Telefon-appen

source: AI-powered real-time scam detection warns you during suspicious calls.
sv: AI-driven bedrägeridetektering i realtid varnar dig under misstänkta samtal.

source: **Types detected:**
sv: **Typer som upptäcks:**

source: Package delivery scams
sv: Paketleveransbedrägerier

source: Job-seeking scams
sv: Jobbskarpabedrägerier

source: Toll road and billing scams
sv: Vägavgifts- och faktureringsbedrägerier

source: Crypto scams
sv: Kryptobedrägerier

source: Financial impersonation
sv: Finansiell imitation

source: Gift card and prize scams
sv: Presentkorts- och vinstbedrägerier

source: Tech support scams
sv: Teknisk support-bedrägerier

source: Open **Phone** app
sv: Öppna appen **Telefon**

source: Tap **More (⋮) > Settings > Caller ID & spam**
sv: Tryck på **Mer (⋮) > Inställningar > Nummerpresentation och spam**

source: Enable **See caller and spam ID**
sv: Aktivera **Se nummerpresentation och spam-ID**

source: Enable **Filter spam calls**
sv: Aktivera **Filtrera spamsamtal**

source: Scam Detection in Messages
sv: Bedrägeridetektering i Meddelanden

source: Detects suspicious conversation patterns and unsafe links.
sv: Upptäcker misstänkta konversationsmönster och osäkra länkar.

source: Open **Messages** app
sv: Öppna appen **Meddelanden**

source: Tap **More (⋮) > Settings > Spam protection**
sv: Tryck på **Mer (⋮) > Inställningar > Spamskydd**

source: Enable **Enable spam protection**
sv: Aktivera **Aktivera spamskydd**

source: OTP Protection (Android 16)
sv: OTP-skydd (Android 16)

source: One-time passwords won't show on lock screen for devices that:
sv: Engångslösenord visas inte på låsskärmen för enheter som:

source: Haven't been recently unlocked
sv: Inte har låsts upp nyligen

source: Aren't connected to known Wi-Fi
sv: Inte är anslutna till känt Wi-Fi

source: 11. Network Security
sv: 11. Nätverkssäkerhet

source: Disable 2G
sv: Inaktivera 2G

source: 2G networks are vulnerable to interception and cell site simulators.
sv: 2G-nätverk är sårbara för avlyssning och cellsitesimulatorer.

source: **How to disable (if not using Advanced Protection):**
sv: **Så här inaktiverar du (om du inte använder Avancerat skydd):**

source: Go to **Settings > Network & internet > SIMs > \[Your SIM\]**
sv: Gå till **Inställningar > Nätverk och internet > SIM-kort > \[Ditt SIM\]**

source: Toggle off **Allow 2G**
sv: Inaktivera **Tillåt 2G**

source: Wi-Fi Security
sv: Wi-Fi-säkerhet

source: **Disable auto-join for insecure networks:**
sv: **Inaktivera automatisk anslutning till osäkra nätverk:**

source: Go to **Settings > Network & internet > Internet**
sv: Gå till **Inställningar > Nätverk och internet > Internet**

source: Tap **Network preferences**
sv: Tryck på **Nätverksinställningar**

source: Disable **Connect to open networks**
sv: Inaktivera **Anslut till öppna nätverk**

source: **Forget insecure networks:**
sv: **Glöm osäkra nätverk:**

source: Go to **Settings > Network & internet > Internet > Saved networks**
sv: Gå till **Inställningar > Nätverk och internet > Internet > Sparade nätverk**

source: Remove networks you don't trust
sv: Ta bort nätverk du inte litar på

source: Use a VPN on public Wi-Fi:
sv: Använd ett VPN på offentligt Wi-Fi:

source: Go to **Settings > Network & internet > VPN**
sv: Gå till **Inställningar > Nätverk och internet > VPN**

source: Configure your VPN provider
sv: Konfigurera din VPN-leverantör

source: DNS Settings
sv: DNS-inställningar

source: Use encrypted DNS:
sv: Använd krypterad DNS:

source: Go to **Settings > Network & internet > Private DNS**
sv: Gå till **Inställningar > Nätverk och internet > Privat DNS**

source: Select **Private DNS provider hostname**
sv: Välj **Värdnamn för privat DNS-leverantör**

source: Enter a provider (e.g., `dns.google` or `cloudflare-dns.com`)
sv: Ange en leverantör (t.ex. `dns.google` eller `cloudflare-dns.com`)

source: 12. USB Protection
sv: 12. USB-skydd

source: Android 16 defaults USB connections to charging-only when locked.
sv: Android 16 ställer in USB-anslutningar till endast laddning som standard när låst.

source: Prevents data transfer via USB when device is locked
sv: Förhindrar dataöverföring via USB när enheten är låst

source: Protects against "juice jacking" attacks at public charging stations
sv: Skyddar mot "juice jacking"-attacker vid offentliga laddstationer

source: Blocks physical data extraction attempts
sv: Blockerar försök till fysisk dataextrahering

source: How It Works
sv: Så fungerar det

source: When Advanced Protection is enabled:
sv: När Avancerat skydd är aktiverat:

source: USB defaults to charging-only when locked
sv: USB ställs in på endast laddning när låst

source: Must unlock device to enable data transfer
sv: Måste låsa upp enheten för att aktivera dataöverföring

source: Manual Configuration
sv: Manuell konfiguration

source: Go to **Settings > Connected devices > USB**
sv: Gå till **Inställningar > Anslutna enheter > USB**

source: When connected, choose **Charging only** unless you need data transfer
sv: När ansluten, välj **Endast laddning** om du inte behöver dataöverföring

source: 13. Find My Device
sv: 13. Hitta min enhet

source: Go to **Settings > Security & Privacy > Find My Device**
sv: Gå till **Inställningar > Säkerhet och integritet > Hitta min enhet**

source: Toggle on **Use Find My Device**
sv: Aktivera **Använd Hitta min enhet**

source: Ensure location is enabled
sv: Se till att plats är aktiverat

source: Locate your device on a map
sv: Hitta din enhet på en karta

source: Play sound to find nearby device
sv: Spela upp ljud för att hitta enhet i närheten

source: Secure device (lock with message)
sv: Säkra enhet (lås med meddelande)

source: Erase device remotely
sv: Radera enhet på distans

source: Locate offline devices using nearby Android devices
sv: Hitta offlineenheter med hjälp av Android-enheter i närheten

source: Find My Device Network
sv: Hitta min enhet-nätverk

source: Android can find your device even when offline using Bluetooth signals from nearby Android devices.
sv: Android kan hitta din enhet även när den är offline med hjälp av Bluetooth-signaler från Android-enheter i närheten.

source: Go to **Settings > Google > All services > Find My Device**
sv: Gå till **Inställningar > Google > Alla tjänster > Hitta min enhet**

source: Toggle on **Find your offline devices**
sv: Aktivera **Hitta dina offlineenheter**

source: Using Find My Device
sv: Använda Hitta min enhet

source: Go to android.com/find or use Find My Device app on another device
sv: Gå till android.com/find eller använd Hitta min enhet-appen på en annan enhet

source: Sign in with your Google Account
sv: Logga in med ditt Google-konto

source: Select your device
sv: Välj din enhet

source: Choose action: Locate, Play Sound, Secure Device, Erase Device
sv: Välj åtgärd: Hitta, Spela upp ljud, Säkra enhet, Radera enhet

source: 14. Advertising & Tracking Controls
sv: 14. Reklam- och spårningskontroller

source: Delete Advertising ID
sv: Ta bort reklam-ID

source: Disabling AAID makes it harder for advertisers to track you.
sv: Att inaktivera AAID gör det svårare för annonsörer att spåra dig.

source: **How to delete:**
sv: **Så här tar du bort:**

source: Go to **Settings > Security & Privacy > Privacy Controls > Ads**
sv: Gå till **Inställningar > Säkerhet och integritet > Integritetskontroller > Annonser**

source: Tap **Delete advertising ID**
sv: Tryck på **Ta bort reklam-ID**

source: Confirm
sv: Bekräfta

source: Disable Personalized Ads
sv: Inaktivera personanpassade annonser

source: Go to **Settings > Google > Ads**
sv: Gå till **Inställningar > Google > Annonser**

source: Toggle off **Opt out of Ads Personalization**
sv: Inaktivera **Avstå från annonspersonalisering**

source: Unknown Tracker Alerts
sv: Varningar för okända spårare

source: Android detects unfamiliar tracking devices (like AirTags) moving with you.
sv: Android upptäcker okända spårningsenheter (som AirTags) som rör sig med dig.

source: **How to check:**
sv: **Så här kontrollerar du:**

source: Go to **Settings > Security & Privacy > More security & privacy > Unknown tracker alerts**
sv: Gå till **Inställningar > Säkerhet och integritet > Mer säkerhet och integritet > Varningar för okända spårare**

source: Ensure it's enabled
sv: Se till att det är aktiverat

source: 15. Google Account Privacy
sv: 15. Integritet för Google-konto

source: Privacy Checkup
sv: Integritetskontroll

source: Tap **Data & privacy**
sv: Tryck på **Data och integritet**

source: Tap **Review your privacy settings**
sv: Tryck på **Granska dina integritetsinställningar**

source: Activity Controls
sv: Aktivitetskontroller

source: Control what Google saves about your activity:
sv: Kontrollera vad Google sparar om din aktivitet:

source: Under "History settings," review:
sv: Under "Historikinställningar" granskar du:

source: **Web & App Activity** – Search and app activity
sv: **Webb- och appaktivitet** – Sök- och appaktivitet

source: **Location History** – Places you've been
sv: **Platshistorik** – Platser du har besökt

source: **YouTube History** – Videos watched
sv: **YouTube-historik** – Videor du har tittat på

source: For each:
sv: För varje:

source: Turn off to stop saving
sv: Stäng av för att sluta spara

source: Enable auto-delete (3, 18, or 36 months)
sv: Aktivera automatisk radering (3, 18 eller 36 månader)

source: Privacy Dashboard
sv: Integritetspanel

source: View recent permission usage:
sv: Visa senaste behörighetsanvändning:

source: Go to **Settings > Security & Privacy > Privacy Controls > Privacy dashboard**
sv: Gå till **Inställningar > Säkerhet och integritet > Integritetskontroller > Integritetspanel**

source: See which apps accessed location, camera, microphone in last 24 hours
sv: Se vilka appar som har använt plats, kamera, mikrofon de senaste 24 timmarna

source: 16. Chrome & Browser Privacy
sv: 16. Chrome- och webbläsarintegritet

source: Safe Browsing
sv: Säker surfning

source: **Enable Enhanced Protection:**
sv: **Aktivera förbättrat skydd:**

source: Open **Chrome**
sv: Öppna **Chrome**

source: Tap **More (⋮) > Settings > Privacy and security > Safe Browsing**
sv: Tryck på **Mer (⋮) > Inställningar > Sekretess och säkerhet > Säker surfning**

source: Select **Enhanced protection**
sv: Välj **Förbättrat skydd**

source: Privacy Settings
sv: Integritetsinställningar

source: Open **Chrome > Settings > Privacy and security**
sv: Öppna **Chrome > Inställningar > Sekretess och säkerhet**

source: Configure:
sv: Konfigurera:

source: **Clear browsing data** – Regularly clear history, cookies, cache
sv: **Rensa webbinformation** – Rensa regelbundet historik, kakor, cache

source: **Always use secure connections** – Forces HTTPS
sv: **Använd alltid säkra anslutningar** – Tvingar HTTPS

source: **Do Not Track** – Send request to sites (limited effectiveness)
sv: **Spåra inte** – Skicka begäran till webbplatser (begränsad effektivitet)

source: **Preload pages** – Disable for more privacy
sv: **Förhandsladda sidor** – Inaktivera för mer integritet

source: Incognito Mode
sv: Inkognitoläge

source: For private browsing:
sv: För privat surfning:

source: Open Chrome
sv: Öppna Chrome

source: Tap **More (⋮) > New Incognito tab**
sv: Tryck på **Mer (⋮) > Ny inkognitoflik**

source: Incognito doesn't make you anonymous—your ISP and websites can still see your activity.
sv: Inkognito gör dig inte anonym—din internetleverantör och webbplatser kan fortfarande se din aktivitet.

source: Third-Party Cookies
sv: Tredjepartskakor

source: Go to **Chrome > Settings > Site settings > Cookies**
sv: Gå till **Chrome > Inställningar > Webbplatsinställningar > Kakor**

source: Select **Block third-party cookies**
sv: Välj **Blockera tredjepartskakor**

source: 17. Additional Security Recommendations
sv: 17. Ytterligare säkerhetsrekommendationer

source: Software Updates
sv: Programuppdateringar

source: Go to **Settings > System > Software update**
sv: Gå till **Inställningar > System > Programuppdatering**

source: Enable automatic updates
sv: Aktivera automatiska uppdateringar

source: Install security patches promptly
sv: Installera säkerhetspatchar omedelbart

source: Go to **Settings > Notifications > Notifications on lock screen**
sv: Gå till **Inställningar > Aviseringar > Aviseringar på låsskärmen**

source: Choose **Show sensitive content only when unlocked** or **Don't show any notifications**
sv: Välj **Visa känsligt innehåll endast när upplåst** eller **Visa inga aviseringar**

source: App Installation from Unknown Sources
sv: Appinstallation från okända källor

source: Go to **Settings > Apps > Special app access > Install unknown apps**
sv: Gå till **Inställningar > Appar > Särskild appåtkomst > Installera okända appar**

source: Ensure all apps show **Not allowed**
sv: Se till att alla appar visar **Inte tillåten**

source: Only enable temporarily when needed, then disable
sv: Aktivera endast tillfälligt vid behov, inaktivera sedan

source: Backup Encryption
sv: Säkerhetskopieringskryptering

source: Go to **Settings > Google > Backup**
sv: Gå till **Inställningar > Google > Säkerhetskopiering**

source: Ensure **Backup by Google One** is on
sv: Se till att **Säkerhetskopiering med Google One** är på
