Repository: kushaldas/securitybook
Catalog: po/*.po
Languages: sv

source: Fingerprint Security Improvements
sv: Förbättringar av fingeravtryckssäkerhet

source: GrapheneOS limits fingerprint attempts to **5 total** (vs 20 on stock Android with delays):
sv: GrapheneOS begränsar fingeravtrycksförsök till **5 totalt** (mot 20 på vanlig Android med fördröjningar):

source: Makes intentional lockout easy (use wrong finger 5 times)
sv: Gör avsiktlig utlåsning enkel (använd fel finger 5 gånger)

source: Significantly reduces brute-force risk
sv: Minskar betydligt risken för brute-force

source: 6. Exploit Protection
sv: 6. Exploateringsskydd

source: **Location:** Settings > Security & privacy > Exploit protection
sv: **Plats:** Inställningar > Säkerhet och integritet > Exploateringsskydd

source: GrapheneOS includes extensive hardening against memory corruption and other exploits.
sv: GrapheneOS inkluderar omfattande härdning mot minneskorruption och andra exploateringar.

source: Auto Reboot
sv: Automatisk omstart

source: **Purpose:** Returns device to "at rest" state, clearing encryption keys from memory
sv: **Syfte:** Återställer enheten till "viloläge" och rensar krypteringsnycklar från minnet

source: Effect
sv: Effekt

source: **10 minutes - 72 hours**
sv: **10 minuter - 72 timmar**

source: Device reboots if not unlocked within this time
sv: Enheten startar om om den inte låses upp inom denna tid

source: **Off**
sv: **Av**

source: Disabled (not recommended)
sv: Inaktiverat (rekommenderas inte)

source: **Default: 18 hours**
sv: **Standard: 18 timmar**

source: Good balance for most users
sv: Bra balans för de flesta användare

source: **Recommendation:** Set to **8-12 hours** for higher security, or keep default 18 hours
sv: **Rekommendation:** Ställ in på **8–12 timmar** för högre säkerhet, eller behåll standard 18 timmar

source: Timer starts when device locks
sv: Timern startar när enheten låses

source: Unlocking any profile resets timer
sv: Upplåsning av vilken profil som helst återställer timern

source: After timeout, device reboots to Before First Unlock (BFU) state
sv: Efter timeout startar enheten om till Before First Unlock (BFU)-tillstånd

source: All encryption keys cleared, data fully at rest
sv: Alla krypteringsnycklar rensade, data helt i vila

source: See [Section 12](#12-usb-c-port--pogo-pins-control) for detailed configuration.
sv: Se [avsnitt 12](#12-usb-c-port--pogo-pins-control) för detaljerad konfiguration.

source: Wi-Fi Auto-Off
sv: Automatisk av Wi-Fi

source: **Purpose:** Disables Wi-Fi after disconnect to reduce attack surface
sv: **Syfte:** Inaktiverar Wi-Fi efter frånkoppling för att minska attackytan

source: **Options:** 10 minutes, 30 minutes, 1 hour, 2 hours, Off
sv: **Alternativ:** 10 minuter, 30 minuter, 1 timme, 2 timmar, Av

source: **Recommendation:** 10 minutes
sv: **Rekommendation:** 10 minuter

source: Bluetooth Auto-Off
sv: Automatisk av Bluetooth

source: **Purpose:** Disables Bluetooth after disconnect to reduce attack surface
sv: **Syfte:** Inaktiverar Bluetooth efter frånkoppling för att minska attackytan

source: **Options:** Same as Wi-Fi
sv: **Alternativ:** Samma som Wi-Fi

source: Secure App Spawning
sv: Säker appstart

source: **Purpose:** Each app gets unique randomized memory layout (ASLR secrets)
sv: **Syfte:** Varje app får unik slumpmässig minneslayout (ASLR-hemligheter)

source: **Default:** Enabled
sv: **Standard:** Aktiverad

source: **Effect:** Prevents cross-app identifier leaks, hardens exploit mitigations
sv: **Effekt:** Förhindrar läckage av identifierare mellan appar, härdar skydd mot exploatering

source: **Trade-off:** Slightly slower cold app starts, slightly higher memory
sv: **Avvägning:** Något långsammare kallstarter, något högre minnesanvändning

source: **Recommendation:** Keep enabled
sv: **Rekommendation:** Behåll aktiverad

source: Native Code Debugging
sv: Nativ koddebuggning

source: **Purpose:** Controls ptrace access for debugging
sv: **Syfte:** Kontrollerar ptrace-åtkomst för debuggning

source: **Bundled apps:** Always blocked
sv: **Medpaketerade appar:** Alltid blockerade

source: **User apps:** Allowed by default (for compatibility)
sv: **Användarappar:** Tillåtna som standard (för kompatibilitet)

source: **Recommendation:** Disable for all apps unless needed for development
sv: **Rekommendation:** Inaktivera för alla appar om det inte behövs för utveckling

source: Dynamic Code Loading Toggles
sv: Växlare för dynamisk kodladdning

source: Control JIT compilation and dynamic code loading:
sv: Kontrollera JIT-kompilering och dynamisk kodladdning:

source: Toggle
sv: Växlare

source: Default
sv: Standard

source: Purpose
sv: Syfte

source: Dynamic code loading from memory
sv: Dynamisk kodladdning från minne

source: Varies
sv: Varierar

source: Blocks in-memory code execution
sv: Blockerar kodexekvering i minnet

source: Dynamic code loading from storage
sv: Dynamisk kodladdning från lagring

source: Blocks loading code from files
sv: Blockerar laddning av kod från filer

source: Enabled for user apps
sv: Aktiverat för användarappar

source: JavaScript JIT in WebView
sv: JavaScript JIT i WebView

source: **Recommendation:** Disable all for apps that don't need them
sv: **Rekommendation:** Inaktivera alla för appar som inte behöver dem

source: 7. Network Permission
sv: 7. Nätverksbehörighet

source: **Location:** App info > Permissions > Network (per-app)
sv: **Plats:** Appinfo > Behörigheter > Nätverk (per app)

source: GrapheneOS adds a **Network permission** not available in stock Android.
sv: GrapheneOS lägger till en **nätverksbehörighet** som inte finns i vanlig Android.

source: When disabled, app sees network as "down" (not permission denied)
sv: När inaktiverat ser appen nätverket som "nere" (inte nekad behörighet)

source: Blocks both direct network access and localhost (prevents cross-profile communication)
sv: Blockerar både direkt nätverksåtkomst och localhost (förhindrar korsprofilkommunikation)

source: Apps handle gracefully since they think network is unavailable
sv: Appar hanterar det smidigt eftersom de tror nätverket är otillgängligt

source: Configuration
sv: Konfiguration

source: During app installation, toggle Network off if not needed
sv: Under appinstallation, växla av Nätverk om det inte behövs

source: Or go to Settings > Apps > \[App\] > Permissions > Network
sv: Eller gå till Inställningar > Appar > \[App\] > Behörigheter > Nätverk

source: Use Cases
sv: Användningsfall

source: **Calculator apps:** Don't need network
sv: **Kalkylatorappar:** Behöver inte nätverk

source: **Offline games:** Don't need network
sv: **Offlinespel:** Behöver inte nätverk

source: **Document editors:** May not need network
sv: **Dokumentredigerare:** Behöver kanske inte nätverk

source: **Privacy-sensitive apps:** Prevent data exfiltration
sv: **Integritetskänsliga appar:** Förhindra dataexfiltration

source: 8. Sensors Permission
sv: 8. Sensorbehörighet

source: **Location:** Settings > Apps > \[App\] > Permissions > Sensors
sv: **Plats:** Inställningar > Appar > \[App\] > Behörigheter > Sensorer

source: GrapheneOS adds a **Sensors permission** for:
sv: GrapheneOS lägger till en **sensorbehörighet** för:

source: Gyroscope
sv: Gyroskop

source: Compass/magnetometer
sv: Kompass/magnetometer

source: Thermometer
sv: Termometer

source: Other device sensors
sv: Andra enhetssensorer

source: When denied, apps receive zeroed sensor data
sv: När nekad får appar nollad sensordata

source: Notification appears when app tries to access blocked sensors
sv: Notifiering visas när app försöker åtkomma blockerade sensorer

source: Does NOT affect Camera, Microphone, or Body Sensors (separate permissions)
sv: Påverkar INTE kamera, mikrofon eller kroppssensorer (separata behörigheter)

source: Global Default
sv: Global standard

source: **Location:** Settings > Security & privacy > More security & privacy
sv: **Plats:** Inställningar > Säkerhet och integritet > Mer säkerhet och integritet

source: Toggle: **Deny Sensors permission by default for newly installed apps**
sv: Växla: **Neka sensorbehörighet som standard för nyinstallerade appar**

source: **Recommendation:** Enable, then grant to apps that need it
sv: **Rekommendation:** Aktivera, bevilja sedan till appar som behöver det

source: 9. Storage Scopes
sv: 9. Lagringsomfång

source: **Location:** Settings > Apps > \[App\] > Permissions > Storage Scopes
sv: **Plats:** Inställningar > Appar > \[App\] > Behörigheter > Lagringsomfång

source: A privacy-preserving alternative to granting full storage access.
sv: Ett integritetsbevarande alternativ till att bevilja full lagringsåtkomst.

source: Instead of granting storage permission, enable **Storage Scopes**
sv: Istället för att bevilja lagringsbehörighet, aktivera **Lagringsomfång**

source: App believes it has full storage access
sv: Appen tror att den har full lagråtkomst

source: App can only see files it created
sv: Appen kan endast se filer den skapat

source: Optionally add specific files/folders as "scopes" for app to access
sv: Lägg valfritt till specifika filer/mappar som "omfång" för appen att komma åt

source: Go to app's permissions
sv: Gå till appens behörigheter

source: Instead of granting Files/Media, enable Storage Scopes
sv: Istället för att bevilja Filer/Media, aktivera Lagringsomfång

source: Add specific files/folders if app needs access to existing files
sv: Lägg till specifika filer/mappar om appen behöver åtkomst till befintliga filer

source: Limitations
sv: Begränsningar

source: If app is uninstalled and reinstalled, it loses access to its previously created files
sv: Om appen avinstalleras och ominstalleras förlorar den åtkomst till sina tidigare skapade filer

source: Workaround: Grant access via SAF (Storage Access Framework) picker
sv: Lösning: Bevilja åtkomst via SAF-väljare (Storage Access Framework)

source: **Photo editors:** Give access only to specific folders
sv: **Fotoredigerare:** Ge endast åtkomst till specifika mappar

source: **Music players:** Access only your music directory
sv: **Musikspelare:** Åtkomst endast till din musikkatalog

source: **Document apps:** Access only Documents folder
sv: **Dokumentappar:** Åtkomst endast till Dokument-mappen

source: 10. Contact Scopes
sv: 10. Kontaktomfång

source: **Location:** Settings > Apps > \[App\] > Permissions > Contact Scopes
sv: **Plats:** Inställningar > Appar > \[App\] > Behörigheter > Kontaktomfång

source: Alternative to granting full contacts access.
sv: Alternativ till att bevilja full kontaktåtkomst.

source: Enable Contact Scopes instead of granting Contacts permission
sv: Aktivera Kontaktomfång istället för att bevilja Kontakter-behörighet

source: App believes it has contacts access
sv: Appen tror att den har kontaktåtkomst

source: By default, app sees empty contact list
sv: Som standard ser appen en tom kontaktlista

source: Selectively add specific contacts or groups
sv: Lägg selektivt till specifika kontakter eller grupper

source: Enable Contact Scopes (don't grant Contacts permission)
sv: Aktivera Kontaktomfång (bevilja inte Kontakter-behörighet)

source: Add specific contacts the app should see
sv: Lägg till specifika kontakter som appen ska se

source: **Messaging apps:** Share only contacts you message
sv: **Meddelandeappar:** Dela endast kontakter du meddelar

source: **Social apps:** Share only relevant contacts
sv: **Sociala appar:** Dela endast relevanta kontakter

source: **Business apps:** Share only work contacts
sv: **Affärsappar:** Dela endast arbetskontakter

source: 11. User Profiles & Private Space
sv: 11. Användarprofiler och Privat utrymme

source: GrapheneOS significantly enhances Android's profile system.
sv: GrapheneOS förbättrar avsevärt Androids profilsystem.

source: User Profiles
sv: Användarprofiler

source: **Location:** Settings > System > Multiple users
sv: **Plats:** Inställningar > System > Flera användare

source: GrapheneOS supports **32 profiles** (vs 4 on stock Android).
sv: GrapheneOS stöder **32 profiler** (mot 4 på vanlig Android).

source: **Key Features:**
sv: **Nyckelfunktioner:**

source: Each profile has completely separate apps, data, encryption keys
sv: Varje profil har helt separata appar, data, krypteringsnycklar

source: Apps cannot communicate across profiles
sv: Appar kan inte kommunicera mellan profiler

source: Separate VPN configurations per profile
sv: Separata VPN-konfigurationer per profil

source: Creating a Profile
sv: Skapa en profil

source: Settings > System > Multiple users
sv: Inställningar > System > Flera användare

source: Tap "Add user"
sv: Tryck på "Lägg till användare"

source: Configure profile name and settings
sv: Konfigurera profilnamn och inställningar

source: End Session
sv: Avsluta session

source: Completely shuts down a profile:
sv: Stänger helt av en profil:

source: Removes encryption keys from memory
sv: Tar bort krypteringsnycklar från minnet

source: Stops all background processes
sv: Stoppar alla bakgrundsprocesser

source: Returns profile to "at rest" state
sv: Återställer profilen till "viloläge"

source: Private Space (Android 15+)
sv: Privat utrymme (Android 15+)

source: **Location:** Settings > Security & privacy > Private Space
sv: **Plats:** Inställningar > Säkerhet och integritet > Privat utrymme

source: An isolated workspace nested inside any user profile.
sv: En isolerad arbetsyta nestlad inuti valfri användarprofil.

source: **Advantages over Work Profile:**
sv: **Fördelar jämfört med arbetsprofil:**

source: Better OS integration
sv: Bättre OS-integrering

source: Stronger isolation
sv: Stärkare isolering

source: Lockable with separate authentication
sv: Låsbar med separat autentisering

source: Hidden from app drawer when locked
sv: Dold från applådan när låst

source: Setup
sv: Konfiguration

source: Settings > Security & privacy > Private Space
sv: Inställningar > Säkerhet och integritet > Privat utrymme

source: Enter current PIN/password
sv: Ange aktuell PIN/lösenord

source: Configure Private Space authentication
sv: Konfigurera Privat utrymme-autentisering

source: Key Behaviors
sv: Nyckelbeteenden

source: When locked: Apps don't run, no notifications
sv: När låst: Appar körs inte, inga notifikationer

source: Separate VPN configuration possible
sv: Separat VPN-konfiguration möjlig

source: Apps show shield icon in launcher
sv: Appar visar sköldikon i startprogrammet

source: Can install apps directly or via Google Play (if installed in Private Space)
sv: Kan installera appar direkt eller via Google Play (om installerad i Privat utrymme)Kan installera appar direkt eller via Google Play (om installerad i Privat utrymme)

source: **Recommendation:** Use Private Space instead of work profiles managed by third-party apps
sv: **Rekommendation:** Använd Privat utrymme istället för arbetsprofiler som hanteras av tredjepartsappar

source: Notification Forwarding
sv: Notifikationsvidarebefordran

source: **Location:** Within each profile's settings
sv: **Plats:** I varje profils inställningar

source: Forward notifications from background profiles to active profile:
sv: Vidarebefordra notifikationer från bakgrundsprofiler till aktiv profil:

source: Disabled by default
sv: Inaktiverat som standard

source: Enable per-profile where needed
sv: Aktivera per profil där det behövs

source: 12. USB-C Port & Pogo Pins Control
sv: 12. USB-C-port och Pogo-stiftkontroll

source: **Location:** Settings > Security & privacy > Exploit protection > USB-C port
sv: **Plats:** Inställningar > Säkerhet och integritet > Exploateringsskydd > USB-C-port

source: Modes
sv: Lägen

source: Mode
sv: Läge

source: Description
sv: Beskrivning

source: USB fully disabled (including charging) - maximum security
sv: USB helt inaktiverat (inklusive laddning) – maximal säkerhet

source: **Charging-only**
sv: **Endast laddning**

source: Always data disabled, charging only
sv: Data alltid inaktiverat, endast laddning

source: **Charging-only when locked**
sv: **Endast laddning när låst**

source: Data works when unlocked, charging-only when locked (DEFAULT)
sv: Data fungerar när upplåst, endast laddning när låst (STANDARD)

source: **Charging-only when locked, except before first unlock**
sv: **Endast laddning när låst, förutom före första upplåsning**

source: Same as above but allows data in BFU state
sv: Samma som ovan men tillåter data i BFU-tillstånd

source: **On**
sv: **På**

source: USB always enabled
sv: USB alltid aktiverat

source: How It Differs from Stock Android
sv: Hur det skiljer sig från standard-Android

source: Aspect
sv: Aspekt

source: Level
sv: Nivå

source: Software only
sv: Endast programvara

source: Hardware + software
sv: Hårdvara + programvara

source: Data lines
sv: Datalinjer

source: OS-level block
sv: OS-nivåblockering

source: Hardware disabled
sv: Hårdvaruinaktiverad

source: New connections
sv: Nya anslutningar

source: Allowed until toggle
sv: Tillåtet tills omkoppling

source: Blocked immediately when locked
sv: Blockeras omedelbart när låst

source: Alternate modes (DisplayPort)
sv: Alternativa lägen (DisplayPort)

source: Still work
sv: Fungerar fortfarande

source: Disabled when locked
sv: Inaktiverat när låst

source: Recommendation
sv: Rekommendation

source: **Default (Charging-only when locked)** - Good for most users
sv: **Standard (Endast laddning när låst)** – Bra för de flesta användare

source: **Charging-only** - If you never use USB data
sv: **Endast laddning** – Om du aldrig använder USB-data

source: **Off** - Maximum security, charge only when powered off
sv: **Av** – Maximal säkerhet, ladda endast när avstängd

source: 13. Wi-Fi & Bluetooth Privacy
sv: 13. Wi-Fi- och Bluetooth-integritet

source: Wi-Fi MAC Randomization
sv: Wi-Fi MAC-randomisering

source: **Location:** Settings > Network & internet > Wi-Fi > \[Network\] > Privacy
sv: **Plats:** Inställningar > Nätverk och internet > Wi-Fi > \[Nätverk\] > Integritet

source: GrapheneOS uses **per-connection MAC randomization** by default:
sv: GrapheneOS använder **MAC-randomisering per anslutning** som standard:

source: New random MAC for each connection (not just per-network)
sv: Ny slumpmässig MAC för varje anslutning (inte bara per nätverk)

source: DHCP state flushed before reconnecting
sv: DHCP-tillstånd rensas innan återanslutning

source: Significantly harder to track across reconnections
sv: Betydligt svårare att spåra över återanslutningar

source: Automatically disables Wi-Fi after disconnection
sv: Inaktiverar Wi-Fi automatiskt efter frånkoppling

source: Reduces attack surface when not actively using Wi-Fi
sv: Minskar attackytan när Wi-Fi inte aktivt används

source: Bluetooth Privacy
sv: Bluetooth-integritet

source: Set device name to something generic: Settings > Bluetooth > Device name
sv: Sätt enhetsnamn till något generiskt: Inställningar > Bluetooth > Enhetsnamn

source: Recommendation: Set to "Device" or similar
sv: Rekommendation: Sätt till "Enhet" eller liknande

source: Enable Bluetooth auto-off in Exploit protection
sv: Aktivera automatisk avstängning av Bluetooth i Exploateringsskydd

source: Scanning Settings
sv: Skanningsinställningar

source: **Location:** Settings > Location > Location services
sv: **Plats:** Inställningar > Plats > Platstjänster

source: Wi-Fi scanning
sv: Wi-Fi-skanning

source: OFF
sv: AV

source: Bluetooth scanning
sv: Bluetooth-skanning

source: These allow location tracking even when Wi-Fi/Bluetooth are "off."
sv: Dessa tillåter platsspårning även när Wi-Fi/Bluetooth är "av."

source: 14. VPN Configuration
sv: 14. VPN-konfiguration

source: Always-On VPN
sv: Alltid-på VPN

source: **Location:** Settings > Network & internet > VPN > \[Your VPN\] > gear icon
sv: **Plats:** Inställningar > Nätverk och internet > VPN > \[Din VPN\] > kugghjulsikon

source: GrapheneOS enables these toggles **by default**:
sv: GrapheneOS aktiverar dessa växlar **som standard**:

source: Always-on VPN
sv: Alltid-på VPN

source: Block connections without VPN
sv: Blockera anslutningar utan VPN

source: Improved Leak Protection
sv: Förbättrat läckageskydd

source: GrapheneOS fixes multiple VPN leak vectors:
sv: Åtgärdar flera VPN-läckageproblem:

source: Leak Type
sv: Läckagetyp

source: DNS before VPN up
sv: DNS innan VPN är uppe

source: Can leak
sv: Kan läcka

source: Fixed
sv: Åtgärdat

source: DNS to VPN server outside tunnel
sv: DNS till VPN-server utanför tunneln

source: Multicast packets
sv: Multicast-paket

source: Can bypass
sv: Kan förbigå

source: Blocked
sv: Blockerad

source: Cross-profile multicast
sv: Multicast mellan profiler

source: Possible
sv: Möjligt

source: Interface bypass (setsockopt)
sv: Gränssnittsförbigång (setsockopt)

source: Per-Profile VPN
sv: VPN per profil

source: Each profile (user profile, Private Space) has **independent VPN configuration**:
sv: Varje profil (användarprofil, Privat utrymme) har **oberoende VPN-konfiguration**:

source: Can use different VPNs
sv: Kan använda olika VPN

source: Can have different exit IPs/countries
sv: Kan ha olika utgångs-IP/länder

source: Complete isolation
sv: Fullständig isolering

source: Private DNS
sv: Privat DNS

source: **Location:** Settings > Network & internet > Private DNS
sv: **Plats:** Inställningar > Nätverk och internet > Privat DNS

source: **Recommendation:** Use a privacy-respecting DNS provider:
sv: **Rekommendation:** Använd en integritetsrespekterande DNS-leverantör:

source: Custom NextDNS configuration
sv: Anpassad NextDNS-konfiguration

source: Or your VPN's DNS
sv: Eller din VPN:s DNS

source: Internet Connectivity Checks
sv: Internetanslutningskontroller

source: **Location:** Settings > Network & internet > Internet connectivity checks
sv: **Plats:** Inställningar > Nätverk och internet > Internetanslutningskontroller

source: Options:
sv: Alternativ:

source: **GrapheneOS server** (default) - Privacy-preserving
sv: **GrapheneOS-server** (standard) – Integritetsskyddande

source: **Standard (Google)** - For blending in
sv: **Standard (Google)** – För att smala in

source: **Off** - May cause issues with captive portals
sv: **Av** – Kan orsaka problem med captive portals

source: 15. Sandboxed Google Play
sv: 15. Sandlåde-Google Play

source: GrapheneOS allows running Google Play as a **regular sandboxed app** with no special privileges.
sv: GrapheneOS tillåter körning av Google Play som en **vanlig sandlådeapp** utan speciella privilegier.

source: Key Properties
sv: Nyckelegenskaper

source: Google Play runs as normal app - no system-level access
sv: Google Play körs som vanlig app – ingen systemnivååtkomst

source: Cannot access device identifiers (IMEI, etc.)
sv: Kan inte komma åt enhetsidentifierare (IMEI, etc.)

source: All permissions revocable
sv: Alla behörigheter återkallbara

source: Only available within the profile where installed
sv: Endast tillgänglig inom profilen där den är installerad

source: Location requests rerouted to GrapheneOS implementation by default
sv: Platsförfrågningar omdirigeras till GrapheneOS-implementering som standard

source: Open **Apps** (GrapheneOS app store)
sv: Öppna **Appar** (GrapheneOS appbutik)

source: Select **Google Play services**
sv: Välj **Google Play-tjänster**

source: Install (automatically includes Play Store)
sv: Installera (inkluderar automatiskt Play Butik)

source: Grant battery optimization exception for push notifications
sv: Bevilja undantag från batterioptimering för push-aviseringar

source: **Location:** Settings > Apps > Sandboxed Google Play
sv: **Plats:** Inställningar > Appar > Sandlåde-Google Play

source: Reroute location requests
sv: Omdirigera platsförfrågningar

source: Uses GrapheneOS location instead of Google's (default: on)
sv: Använder GrapheneOS plats istället för Googles (standard: på)

source: Profile Strategy
sv: Profilstrategi
