Repository: kushaldas/securitybook
Catalog: po/*.po
Languages: sv

source: iOS 26 automatically strips tracking parameters (UTMs) from URLs in Safari Private Browsing, Messages, and Mail.
sv: iOS 26 tar automatiskt bort spårningsparametrar (UTM:er) från URL:er i Safaris privata surfning, Meddelanden och Mail.

source: 7. Mail Privacy Protection
sv: 7. Integritetsskydd för Mail

source: Features
sv: Funktioner

source: Hides your IP address from senders
sv: Döljer din IP-adress från avsändare

source: Prevents open tracking
sv: Förhindrar öppningsspårning

source: Blocks invisible tracking pixels
sv: Blockerar osynliga spårningspixlar

source: Go to **Settings > Apps > Mail > Privacy Protection**
sv: Gå till **Inställningar > Appar > Mail > Integritetsskydd**

source: Enable **Protect Mail Activity**
sv: Aktivera **Skydda Mail-aktivitet**

source: Or configure separately:
sv: Eller konfigurera separat:

source: **Hide IP Address**
sv: **Dölj IP-adress**

source: **Block All Remote Content**
sv: **Blockera allt fjärrinnehåll**

source: 8. Passwords App
sv: 8. Appen Lösenord

source: iOS 26 significantly enhances the standalone Passwords app.
sv: iOS 26 förbättrar avsevärt den fristående appen Lösenord.

source: New Features in iOS 26
sv: Nya funktioner i iOS 26

source: **Password Version History** – View previous passwords for any account with timestamps
sv: **Lösenordsversionshistorik** – Visa tidigare lösenord för alla konton med tidsstämplar

source: **Secure Export** – FIDO Alliance standard for moving passwords, passkeys, and verification codes to other managers
sv: **Säker export** – FIDO Alliance-standard för att flytta lösenord, nycklar och verifieringskoder till andra hanterare

source: **Automatic Passkey Upgrades** – When you sign in with a password, system can create a passkey for next time
sv: **Automatiska nyckeluppgraderingar** – När du loggar in med ett lösenord kan systemet skapa en nyckel för nästa gång

source: **Credential Management Endpoints** – Prompts to upgrade passwords to passkeys
sv: **Slutpunkter för inloggningshantering** – Uppmaningar att uppgradera lösenord till nycklar

source: **Websites to Exclude** – Manage sites where passwords shouldn't be saved
sv: **Webbplatser att exkludera** – Hantera webbplatser där lösenord inte ska sparas

source: How to Access
sv: Så får du åtkomst

source: Open the **Passwords** app
sv: Öppna appen **Lösenord**

source: View Password History
sv: Visa lösenordshistorik

source: Open **Passwords**
sv: Öppna **Lösenord**

source: Select a saved login
sv: Välj en sparad inloggning

source: Tap **View History** (appears when multiple versions exist)
sv: Tryck på **Visa historik** (visas när flera versioner finns)

source: Export Passwords Securely
sv: Exportera lösenord säkert

source: Tap **Settings** (gear icon)
sv: Tryck på **Inställningar** (kugghjulsikonen)

source: Select **Export Passwords**
sv: Välj **Exportera lösenord**

source: Choose destination app (uses encrypted FIDO Alliance format)
sv: Välj målapp (använder krypterat FIDO Alliance-format)

source: Security Alerts
sv: Säkerhetsvarningar

source: The app warns about:
sv: Appen varnar om:

source: Credentials in known data breaches
sv: Inloggningsuppgifter i kända dataläckor

source: Weak passwords
sv: Svaga lösenord

source: Reused passwords
sv: Återanvända lösenord

source: 9. Advanced Data Protection for iCloud
sv: 9. Avancerat dataskydd för iCloud

source: End-to-end encryption for the majority of your iCloud data.
sv: Ändpunkt-till-ändpunkt-kryptering för majoriteten av dina iCloud-data.

source: What It Protects (25 categories total)
sv: Vad det skyddar (25 kategorier totalt)

source: iCloud Backup (including Messages)
sv: iCloud-säkerhetskopiering (inklusive Meddelanden)

source: Photos
sv: Foton

source: Notes
sv: Anteckningar

source: Reminders
sv: Påminnelser

source: Safari Bookmarks
sv: Safari-bokmärken

source: Voice Memos
sv: Röstmemon

source: Freeform boards
sv: Freeform-tavlor

source: And more...
sv: Och mer...

source: **Cannot be encrypted:**
sv: **Kan inte krypteras:**

source: iCloud Mail, Contacts, Calendars (due to interoperability requirements)
sv: iCloud Mail, Kontakter, Kalendrar (på grund av interoperabilitetskrav)

source: Go to **Settings > \[Your Name\] > iCloud**
sv: Gå till **Inställningar > \[Ditt namn\] > iCloud**

source: Tap **Advanced Data Protection**
sv: Tryck på **Avancerat dataskydd**

source: Tap **Turn On Advanced Data Protection**
sv: Tryck på **Aktivera Avancerat dataskydd**

source: Set up recovery method first:
sv: Ställ in återställningsmetod först:

source: **Recovery Contact** – Trusted person to help regain access
sv: **Återställningskontakt** – Betrodd person som kan hjälpa dig att återfå åtkomst

source: **Recovery Key** – 28-character code to store securely
sv: **Återställningsnyckel** – 28-teckens kod att förvara säkert

source: **Apple cannot recover your data** if you lose access
sv: **Apple kan inte återställa dina data** om du förlorar åtkomst

source: All devices must run supported OS versions
sv: Alla enheter måste köra operativsystemversioner som stöds

source: iCloud.com access is disabled by default
sv: Åtkomst till iCloud.com är inaktiverad som standard

source: 10. Lockdown Mode
sv: 10. Låsningsläge

source: Extreme protection for users who may be targeted by sophisticated attacks. This mode significantly restricts device functionality to reduce attack surfaces, but also provides robust defense against mercenary spyware.
sv: Extremt skydd för användare som kan vara mål för sofistikerade attacker. Detta läge begränsar enhetens funktionalitet avsevärt för att minska attackytor, men ger också ett robust försvar mot kommersiellt spionprogram.

source: Who Should Use It
sv: Vem bör använda det

source: Journalists, activists, diplomats
sv: Journalister, aktivister, diplomater

source: High-profile individuals
sv: Högprofilerade individer

source: Anyone targeted by mercenary spyware
sv: Alla som är mål för kommersiellt spionprogram

source: What Lockdown Mode Does
sv: Vad Låsningsläge gör

source: **Messages:** Most attachments blocked
sv: **Meddelanden:** De flesta bilagor blockeras

source: **Web:** Complex technologies disabled (JIT JavaScript)
sv: **Webb:** Komplexa teknologier inaktiverade (JIT JavaScript)

source: **FaceTime:** Incoming calls blocked from unknown contacts
sv: **FaceTime:** Inkommande samtal blockeras från okända kontakter

source: **Photos:** Location excluded from shared photos
sv: **Foton:** Plats exkluderas från delade foton

source: **Device:** Wired connections blocked when locked
sv: **Enhet:** Trådbundna anslutningar blockeras när enheten är låst

source: **Wireless:** 2G cellular disabled, won't auto-join insecure Wi-Fi
sv: **Trådlöst:** 2G-mobilnät inaktiverat, ansluter inte automatiskt till osäkra Wi-Fi-nätverk

source: Scroll down and tap **Lockdown Mode**
sv: Scrolla ner och tryck på **Låsningsläge**

source: Tap **Turn On Lockdown Mode**
sv: Tryck på **Aktivera Låsningsläge**

source: Tap **Turn On & Restart**
sv: Tryck på **Aktivera och starta om**

source: 11. Communication Safety & Parental Controls
sv: 11. Kommunikationssäkerhet och föräldrakontroller

source: Enhanced Parental Controls (iOS 26)
sv: Förbättrade föräldrakontroller (iOS 26)

source: iOS 26 significantly strengthens parental controls:
sv: iOS 26 förstärker föräldrakontrollerna avsevärt:

source: **Child Accounts** – Create or move kids into managed accounts easily
sv: **Barnkonton** – Skapa eller flytta barn till hanterade konton enkelt

source: **Communication Controls** – Decide who children can text/call
sv: **Kommunikationskontroller** – Bestäm vilka barn kan skicka meddelanden till/ringa

source: **Third-Party App Management** – Control messaging in gaming and social apps
sv: **Hantering av tredjepartsappar** – Kontrollera meddelanden i spel- och sociala appar

source: **Unknown Number Blocking** – Block calls/messages from unknown numbers
sv: **Blockering av okända nummer** – Blockera samtal/meddelanden från okända nummer

source: **Age Limits** – Set strict age limits for app downloads
sv: **Åldersgränser** – Ställ in strikta åldersgränser för appnedladdningar

source: **Explicit Content Detection** – Blurs inappropriate content in shared albums and FaceTime
sv: **Detektering av explicit innehåll** – Suddar ut olämpligt innehåll i delade album och FaceTime

source: Communication Safety
sv: Kommunikationssäkerhet

source: Protects children from sensitive content in Messages:
sv: Skyddar barn från känsligt innehåll i Meddelanden:

source: Go to **Settings > Screen Time**
sv: Gå till **Inställningar > Skärmtid**

source: Tap **Communication Safety**
sv: Tryck på **Kommunikationssäkerhet**

source: Toggle on **Communication Safety**
sv: Aktivera **Kommunikationssäkerhet**

source: Sensitive Content Warning (Adults)
sv: Varning för känsligt innehåll (vuxna)

source: Go to **Settings > Privacy & Security > Sensitive Content Warning**
sv: Gå till **Inställningar > Integritet och säkerhet > Varning för känsligt innehåll**

source: Toggle on to blur sensitive images
sv: Aktivera för att sudda ut känsliga bilder

source: 12. Safety Check
sv: 12. Säkerhetskontroll

source: Quickly review and reset access you've granted to others.
sv: Granska och återställ snabbt åtkomst du har beviljat andra.

source: Tap **Safety Check**
sv: Tryck på **Säkerhetskontroll**

source: Options
sv: Alternativ

source: **Manage Sharing & Access:** Granular control over individual permissions
sv: **Hantera delning och åtkomst:** Detaljerad kontroll över individuella behörigheter

source: **Emergency Reset:** Immediately stops all sharing, resets permissions, signs out of iCloud on other devices
sv: **Nödåterställning:** Stoppar omedelbart all delning, återställer behörigheter, loggar ut från iCloud på andra enheter

source: **Quick Exit:** Instantly returns to Home Screen (progress saved)
sv: **Snabbavslut:** Återgår omedelbart till hemskärmen (framsteg sparas)

source: 13. Find My iPhone
sv: 13. Hitta min iPhone

source: Go to **Settings > \[Your Name\] > Find My**
sv: Gå till **Inställningar > \[Ditt namn\] > Hitta**

source: Tap **Find My iPhone**
sv: Tryck på **Hitta min iPhone**

source: Enable:
sv: Aktivera:

source: **Find My iPhone**
sv: **Hitta min iPhone**

source: **Find My Network** (locate even when offline)
sv: **Hitta-nätverket** (hitta även offline)

source: **Send Last Location**
sv: **Skicka senaste plats**

source: Activation Lock for Parts (iOS 26)
sv: Aktiveringslås för delar (iOS 26)

source: iOS 26 extends Activation Lock to individual components (batteries, cameras, displays), making stolen parts unusable.
sv: iOS 26 utökar aktiveringslåset till enskilda komponenter (batterier, kameror, skärmar), vilket gör stulna delar oanvändbara.

source: AirTag (2nd Generation) - iOS 26.2.1 Required
sv: AirTag (2:a generationen) - iOS 26.2.1 krävs

source: The new AirTag (released January 26, 2026) requires iOS 26.2.1 or later and includes significant security and tracking improvements:
sv: Den nya AirTag (släppt 26 januari 2026) kräver iOS 26.2.1 eller senare och inkluderar betydande förbättringar av säkerhet och spårning:

source: **Enhanced Finding Capabilities:**
sv: **Förbättrade sökfunktioner:**

source: **50% longer Precision Finding range** via second-generation Ultra Wideband chip
sv: **50 % längre räckvidd för Precision Finding** via andra generationens Ultra Wideband-chip

source: **Precision Finding on Apple Watch** – Works on Apple Watch Series 9+, Ultra 2+ (first time on wrist)
sv: **Precision Finding på Apple Watch** – Fungerar på Apple Watch Series 9+, Ultra 2+ (första gången på handleden)

source: **Expanded Bluetooth range** – Better detection by Find My network devices
sv: **Utökad Bluetooth-räckvidd** – Bättre detektering av Hitta-nätverksenheter

source: **50% louder speaker** – Easier to locate and harder for stalkers to mask
sv: **50 % högre högtalare** – Lättare att hitta och svårare för stalkers att dölja

source: **Anti-Stalking Improvements:**
sv: **Förbättringar mot förföljelse:**

source: Louder alert sounds when separated from owner's device
sv: Högre varningsljud när den separeras från ägarens enhet

source: Improved detection notifications on iPhones
sv: Förbättrade detekteringsnotifikationer på iPhones

source: Same separation alert timing (approximately 8 hours)
sv: Samma tidpunkt för separationsvarning (ungefär 8 timmar)

source: **Share Item Location:**
sv: **Dela objektets plats:**

source: Securely share AirTag location with airlines for lost luggage
sv: Dela AirTag-plats säkert med flygbolag för förlorat bagage

source: 36 airlines supported at launch, 15+ more coming
sv: 36 flygbolag stöds vid lansering, 15+ fler på väg

source: End-to-end encrypted sharing
sv: Ändpunkt-till-ändpunkt-krypterad delning

source: **How to Set Up AirTag (2nd Gen):**
sv: **Så ställer du in AirTag (2:a gen):**

source: Ensure iOS 26.2.1 is installed
sv: Se till att iOS 26.2.1 är installerat

source: Bring AirTag near your iPhone
sv: Håll AirTag nära din iPhone

source: Tap **Connect** when prompted
sv: Tryck på **Anslut** när du uppmanas

source: Name your AirTag and assign an emoji
sv: Namnge din AirTag och tilldela en emoji

source: Register to your Apple ID
sv: Registrera till ditt Apple ID

source: 14. Advertising and Tracking Controls
sv: 14. Reklam- och spårningskontroller

source: Disable Advertising Identifier
sv: Inaktivera annonsidentifierare

source: Toggle off **Allow Apps to Request to Track**
sv: Inaktivera **Tillåt appar att begära spårning**

source: Disable Apple Personalized Ads
sv: Inaktivera Apples personanpassade annonser

source: Go to **Settings > Privacy & Security > Apple Advertising**
sv: Gå till **Inställningar > Integritet och säkerhet > Apple-annonsering**

source: Toggle off **Personalized Ads**
sv: Inaktivera **Personanpassade annonser**

source: Analytics & Improvements
sv: Analys och förbättringar

source: Go to **Settings > Privacy & Security > Analytics & Improvements**
sv: Gå till **Inställningar > Integritet och säkerhet > Analys och förbättringar**

source: Toggle off data sharing options
sv: Inaktivera alternativ för datadelning

source: 15. Apple Intelligence Privacy
sv: 15. Apple Intelligence-integritet

source: On-Device Processing
sv: Bearbetning på enheten

source: Most Apple Intelligence features process data locally on your device.
sv: De flesta Apple Intelligence-funktioner bearbetar data lokalt på din enhet.

source: For complex requests:
sv: För komplexa förfrågningar:

source: Uses Apple's Private Cloud Compute
sv: Använder Apples Private Cloud Compute

source: Data never stored on servers
sv: Data lagras aldrig på servrar

source: Cryptographically verified privacy
sv: Kryptografiskt verifierad integritet

source: Control AI Learning
sv: Kontrollera AI-inlärning

source: Go to **Settings > Apple Intelligence & Siri**
sv: Gå till **Inställningar > Apple Intelligence och Siri**

source: Scroll to **Apps**
sv: Scrolla till **Appar**

source: Toggle off **Learn from this App** for sensitive apps
sv: Inaktivera **Lär dig från den här appen** för känsliga appar

source: 16. Wi-Fi Aware & Network Security (NEW in iOS 26)
sv: 16. Wi-Fi Aware och nätverkssäkerhet (NYTT i iOS 26)

source: A new peer-to-peer networking framework allowing secure connections without access points:
sv: Ett nytt peer-to-peer-nätverksramverk som möjliggör säkra anslutningar utan accesspunkter:

source: Direct encrypted links between devices
sv: Direkta krypterade länkar mellan enheter

source: Ideal for file transfers, gaming, media streaming
sv: Idealiskt för filöverföringar, spel, mediaströmning

source: No internet connection required
sv: Ingen internetanslutning krävs

source: Third-party apps can use this for secure local sharing
sv: Tredjepartsappar kan använda detta för säker lokal delning

source: Post-Quantum Cryptography (iOS 26)
sv: Postkvantkryptografi (iOS 26)

source: iOS 26 adds hybrid post-quantum key exchange to TLS connections:
sv: iOS 26 lägger till hybrid postkvantnyckelutbyte i TLS-anslutningar:

source: Pairs classic elliptic curve math with lattice-based schemes
sv: Kombinerar klassisk elliptisk kurvmatematik med gitterbaserade scheman

source: Protects current data against future quantum computing threats
sv: Skyddar nuvarande data mot framtida kvantdatorhot

source: Works automatically with Apple's networking frameworks
sv: Fungerar automatiskt med Apples nätverksramverk

source: When you connect to public Wi-Fi by filling out a form, iOS 26 can automatically share that form information with your other Apple devices, making it easier to connect securely.
sv: När du ansluter till offentligt Wi-Fi genom att fylla i ett formulär kan iOS 26 automatiskt dela den formulärinformationen med dina andra Apple-enheter, vilket gör det enklare att ansluta säkert.

source: 17. Wired Accessories Security (NEW in iOS 26)
sv: 17. Säkerhet för trådbundna tillbehör (NYTT i iOS 26)

source: Enhanced USB-C/Lightning Port Security
sv: Förbättrad USB-C/Lightning-portsäkerhet

source: iOS 26 gives you explicit control over what happens when accessories connect:
sv: iOS 26 ger dig uttrycklig kontroll över vad som händer när tillbehör ansluts:

source: Scroll to **Accessories**
sv: Scrolla till **Tillbehör**

source: Choose behavior:
sv: Välj beteende:

source: **Allow when unlocked** (default)
sv: **Tillåt när upplåst** (standard)

source: **Always ask**
sv: **Fråga alltid**

source: **Never allow**
sv: **Tillåt aldrig**

source: Why This Matters
sv: Varför detta är viktigt

source: Malicious cables can extract data while appearing to charge
sv: Skadliga kablar kan extrahera data medan de ser ut att ladda

source: Compromised chargers in public places pose real risks
sv: Komprometterade laddare på offentliga platser utgör verkliga risker

source: You now get immediate notification when a cable tries to do more than charge
sv: Du får nu omedelbar notifikation när en kabel försöker göra mer än att ladda

source: Stops "juice jacking" attacks at airports, hotels, and other public charging stations
sv: Stoppar "juice jacking"-attacker på flygplatser, hotell och andra offentliga laddstationer

source: 18. AirDrop Security (NEW in iOS 26.2)
sv: 18. AirDrop-säkerhet (NYTT i iOS 26.2)

source: One-Time AirDrop Codes
sv: Engångskoder för AirDrop

source: iOS 26.2 introduces secure codes for sharing with unknown contacts:
sv: iOS 26.2 introducerar säkra koder för delning med okända kontakter:

source: **How it works:**
sv: **Så fungerar det:**

source: When sharing with someone not in your contacts, generate a temporary code
sv: När du delar med någon som inte finns i dina kontakter, generera en tillfällig kod

source: The receiver displays the code on their device
sv: Mottagaren visar koden på sin enhet

source: Sender enters the code to complete transfer
sv: Avsändaren anger koden för att slutföra överföringen

source: Code is valid for 30 days for that contact
sv: Koden är giltig i 30 dagar för den kontakten

source: Tighter Proximity Detection
sv: Striktare närhetsdetektering

source: AirDrop now shows only devices within close physical proximity, reducing:
sv: AirDrop visar nu bara enheter inom nära fysisk närhet, vilket minskar:

source: Accidental transfers
sv: Oavsiktliga överföringar

source: Unsolicited content ("AirDrop spam")
sv: Oönskat innehåll ("AirDrop-spam")

source: Faster peer-to-peer connections in crowded areas
sv: Snabbare peer-to-peer-anslutningar i trånga områden

source: 19. Additional Security Recommendations
sv: 19. Ytterligare säkerhetsrekommendationer

source: Lock Screen Security
sv: Låsskärmssäkerhet

source: **Disable Control Center from lock screen:**
sv: **Inaktivera Control Center från låsskärmen:**

source: Under **Allow Access When Locked**, toggle off:
sv: Under **Tillåt åtkomst när låst**, inaktivera:

source: Control Center
sv: Kontrollcenter

source: Notification Center
sv: Notiscenter

source: USB Accessories
sv: USB-tillbehör

source: Automatic Software Updates
sv: Automatiska programuppdateringar

source: Go to **Settings > General > Software Update**
sv: Gå till **Inställningar > Allmänt > Programuppdatering**

source: Tap **Automatic Updates**
sv: Tryck på **Automatiska uppdateringar**

source: Enable all options including **Security Responses & System Files**
sv: Aktivera alla alternativ inklusive **Säkerhetssvar och systemfiler**

source: Lock Screen Notifications
sv: Låsskärmsnotifikationer

source: Go to **Settings > Notifications > Show Previews**
sv: Gå till **Inställningar > Notiser > Visa förhandsvisningar**

source: Select **When Unlocked** or **Never**
sv: Välj **När upplåst** eller **Aldrig**

source: Liquid Glass Opacity (iOS 26)
sv: Liquid Glass-opacitet (iOS 26)

source: For better readability and reduced glare:
sv: För bättre läsbarhet och minskat bländande:

source: Go to **Settings > Display & Brightness > Liquid Glass**
sv: Gå till **Inställningar > Skärm och ljusstyrka > Liquid Glass**

source: Choose **Clear** (sharper) or **Tinted** (softer, less glare)
sv: Välj **Klar** (skarpare) eller **Tonad** (mjukare, mindre bländande)

source: Restart After Security Updates
sv: Starta om efter säkerhetsuppdateringar

source: After installing iOS 26.2 or any security update, **restart your device**. Some spyware lives only in volatile memory and is cleared by a reboot.
sv: Efter installation av iOS 26.2 eller någon säkerhetsuppdatering, **starta om din enhet**. Visst spionprogram lever bara i flyktigt minne och rensas vid en omstart.

source: Erase Data After Failed Attempts
sv: Radera data efter misslyckade försök

source: Enable **Erase Data** (erases after 10 failed passcode attempts)
sv: Aktivera **Erase Data** (raderar efter 10 misslyckade lösenkodförsök)

source: Quick Reference: Essential Settings Checklist
sv: Snabbreferens: Checklista för viktiga inställningar

source: Setting
sv: Inställning

source: Location
sv: Plats

source: Recommended
sv: Rekommenderat

source: Settings > Face ID & Passcode
sv: Inställningar > Face ID och lösenkod

source: ✅ Enable
sv: ✅ Aktivera

source: Strong Passcode
sv: Stark lösenkod

source: ✅ Alphanumeric
sv: ✅ Alfanumerisk

source: Two-Factor Authentication
sv: Tvåfaktorsautentisering

source: Settings > \[Name\] > Sign-In & Security
sv: Inställningar > \[Namn\] > Inloggning och säkerhet

source: Stolen Device Protection
sv: Skydd för stulen enhet

source: App Tracking
sv: Appspårning

source: Settings > Privacy & Security > Tracking
sv: Inställningar > Integritet och säkerhet > Spårning

source: ❌ Disable
sv: ❌ Inaktivera

source: Advanced Tracking Protection
sv: Avancerat spårningsskydd

source: Settings > Apps > Safari > Advanced
sv: Inställningar > Appar > Safari > Avancerat

source: ✅ All Browsing
sv: ✅ All surfning

source: Mail Privacy
sv: E-postintegritet

source: Settings > Apps > Mail > Privacy Protection
sv: Inställningar > Appar > Mail > Integritetsskydd

source: Advanced Data Protection
sv: Avancerat dataskydd

source: Settings > \[Name\] > iCloud > Advanced Data Protection
sv: Inställningar > \[Namn\] > iCloud > Avancerat dataskydd

source: Find My
sv: Hitta

source: Settings > \[Name\] > Find My
sv: Inställningar > \[Namn\] > Hitta

source: Automatic Updates
sv: Automatiska uppdateringar

source: Settings > General > Software Update
sv: Inställningar > Allmänt > Programuppdatering

source: Wired Accessories
sv: Trådbundna tillbehör

source: Settings > Face ID & Passcode > Accessories
sv: Inställningar > Face ID och lösenkod > Tillbehör

source: ⚙️ Always Ask
sv: ⚙️ Fråga alltid

source: Lock Screen Previews
sv: Förhandsvisningar på låsskärmen

source: Settings > Notifications > Show Previews
sv: Inställningar > Notiser > Visa förhandsvisningar

source: ⚙️ When Unlocked
sv: ⚙️ När upplåst

source: Conclusion
sv: Slutsats
